OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/placement/7-global.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 2502 components and 16705 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 8986 connections.
[INFO ODB-0133]     Created 1910 nets and 7719 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/placement/7-global.def
###############################################################################
# Created by write_sdc
# Thu Aug 21 22:55:42 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 20.0000 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 60 input buffers.
[INFO RSZ-0028] Inserted 43 output buffers.
[INFO RSZ-0058] Using max wire length 3048um.
[INFO RSZ-0039] Resized 1761 instances.
Placement Analysis
---------------------------------
total displacement      16812.9 u
average displacement        6.5 u
max displacement           99.1 u
original HPWL           52899.9 u
legalized HPWL          77051.6 u
delta HPWL                   46 %

[INFO DPL-0020] Mirrored 788 instances
[INFO DPL-0021] HPWL before           77051.6 u
[INFO DPL-0022] HPWL after            75461.9 u
[INFO DPL-0023] HPWL delta               -2.1 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3311_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3311_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3311_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.32    0.32 ^ _3311_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net72 (net)
                  0.06    0.00    0.32 ^ _2782_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    0.42 ^ _2782_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0182_ (net)
                  0.03    0.00    0.42 ^ _3311_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.42   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3311_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.42   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3312_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3312_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3312_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.32 ^ _3312_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net73 (net)
                  0.07    0.00    0.32 ^ _2784_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.09    0.42 ^ _2784_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0183_ (net)
                  0.03    0.00    0.42 ^ _3312_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.42   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3312_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.42   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3358_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3358_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3358_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.31 ^ _3358_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[24] (net)
                  0.05    0.00    0.31 ^ _2877_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.42 ^ _2877_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0228_ (net)
                  0.04    0.00    0.42 ^ _3358_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.42   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3358_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.42   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3359_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3359_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3359_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.31 ^ _3359_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[25] (net)
                  0.05    0.00    0.31 ^ _2878_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.42 ^ _2878_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0229_ (net)
                  0.04    0.00    0.42 ^ _3359_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.42   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3359_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.42   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3313_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3313_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3313_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.32 ^ _3313_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net74 (net)
                  0.07    0.00    0.32 ^ _2786_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    0.42 ^ _2786_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0184_ (net)
                  0.03    0.00    0.42 ^ _3313_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.42   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3313_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.42   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3261_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.01    6.84 ^ _2699_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2699_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0132_ (net)
                  0.05    0.00    7.19 v _3261_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3261_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.60   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3257_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.01    6.84 ^ _2695_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2695_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0128_ (net)
                  0.05    0.00    7.19 v _3257_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3257_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.61   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3263_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.01    6.84 ^ _2701_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2701_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0134_ (net)
                  0.05    0.00    7.19 v _3263_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3263_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.61   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3264_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.01    6.84 ^ _2702_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2702_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0135_ (net)
                  0.05    0.00    7.19 v _3264_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3264_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.61   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3271_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.00    6.84 ^ _2709_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2709_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0142_ (net)
                  0.05    0.00    7.19 v _3271_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3271_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.61   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3261_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.16    4.55 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.55 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.21    4.75 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.75 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.10 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.10 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.40 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.40 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.55 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.56 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.86 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.86 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.52 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.53 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.83 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.11                           _0839_ (net)
                  0.19    0.01    6.84 ^ _2699_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.19 v _2699_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0132_ (net)
                  0.05    0.00    7.19 v _3261_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.19   data arrival time

                  0.10   20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock network delay (ideal)
                         -0.10   19.90   clock uncertainty
                          0.00   19.90   clock reconvergence pessimism
                                 19.90 ^ _3261_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   19.80   library setup time
                                 19.80   data required time
-----------------------------------------------------------------------------
                                 19.80   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 12.60   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 12.60

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.34
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3131_/CLK ^
   1.80
_3131_/CLK ^
   1.63      0.00       0.17

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             5.98e-04   4.11e-05   2.37e-09   6.39e-04  61.6%
Combinational          2.03e-04   1.95e-04   6.77e-09   3.98e-04  38.4%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  8.01e-04   2.36e-04   9.14e-09   1.04e-03 100.0%
                          77.2%      22.8%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 21538 u^2 58% utilization.
area_report_end
