OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_congestion_friendly/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_congestion_friendly/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_congestion_friendly/tmp/routing/15-resizer_timing.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 2876 components and 18057 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 10060 connections.
[INFO ODB-0133]     Created 2049 nets and 7997 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_congestion_friendly/tmp/routing/15-resizer_timing.def
###############################################################################
# Created by write_sdc
# Thu Aug 21 21:32:57 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 20.0000 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_propagated_clock [get_clocks {i_clk}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0019] Found 37 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 31
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3925

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal      24480         12545          48.75%
met2       Vertical        18360         11540          37.15%
met3       Horizontal      12240          7777          36.46%
met4       Vertical         7344          4620          37.09%
met5       Horizontal       2448          1155          52.82%
---------------------------------------------------------------

[INFO GRT-0101] Running extra iterations to remove overflow.
[INFO GRT-0197] Via related to pin nodes: 11376
[INFO GRT-0198] Via related Steiner nodes: 509
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 13382
[INFO GRT-0112] Final usage 3D: 54353

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1             12545          6384           50.89%             0 /  0 /  0
met2             11540          5739           49.73%             0 /  0 /  0
met3              7777          1223           15.73%             0 /  0 /  0
met4              4620           856           18.53%             0 /  0 /  0
met5              1155             5            0.43%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            37637         14207           37.75%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 149019 um
[INFO GRT-0014] Routed nets: 2049
[INFO GRT-0006] Repairing antennas, iteration 1.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 4
[INFO GRT-0015] Inserted 4 diodes.
[INFO GRT-0009] rerouting 1387 nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 31
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3925
[INFO GRT-0006] Repairing antennas, iteration 2.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 4
[INFO GRT-0015] Inserted 4 diodes.
[INFO GRT-0009] rerouting 6 nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 20
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3925
[INFO GRT-0006] Repairing antennas, iteration 3.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 0
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3313_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3313_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17    0.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17    0.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.43 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15    0.58 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00    0.58 ^ _3313_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.31    0.89 ^ _3313_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net74 (net)
                  0.07    0.00    0.89 ^ _2786_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    0.99 ^ _2786_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0184_ (net)
                  0.03    0.00    0.99 ^ _3313_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.99   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.28 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.28 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.19    0.47 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.47 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.17    0.64 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00    0.64 ^ _3313_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.74   clock uncertainty
                         -0.06    0.68   clock reconvergence pessimism
                         -0.03    0.66   library hold time
                                  0.66   data required time
-----------------------------------------------------------------------------
                                  0.66   data required time
                                 -0.99   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


Startpoint: _3309_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3309_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17    0.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17    0.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.43 ^ clkbuf_leaf_5_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15    0.58 ^ clkbuf_leaf_5_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    15    0.04                           clknet_leaf_5_i_clk (net)
                  0.06    0.00    0.58 ^ _3309_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.31    0.89 ^ _3309_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net101 (net)
                  0.07    0.00    0.89 ^ _2778_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    0.99 ^ _2778_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0180_ (net)
                  0.03    0.00    0.99 ^ _3309_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.99   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.28 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.28 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.19    0.47 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.47 ^ clkbuf_leaf_5_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.17    0.64 ^ clkbuf_leaf_5_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    15    0.04                           clknet_leaf_5_i_clk (net)
                  0.06    0.00    0.64 ^ _3309_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.74   clock uncertainty
                         -0.06    0.68   clock reconvergence pessimism
                         -0.03    0.66   library hold time
                                  0.66   data required time
-----------------------------------------------------------------------------
                                  0.66   data required time
                                 -0.99   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


Startpoint: _3343_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3343_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17    0.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17    0.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.43 ^ clkbuf_leaf_5_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15    0.58 ^ clkbuf_leaf_5_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    15    0.04                           clknet_leaf_5_i_clk (net)
                  0.06    0.00    0.58 ^ _3343_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.30    0.88 ^ _3343_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[9] (net)
                  0.05    0.00    0.88 ^ _2862_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.99 ^ _2862_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0213_ (net)
                  0.04    0.00    0.99 ^ _3343_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.99   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.28 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.28 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.19    0.47 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.47 ^ clkbuf_leaf_5_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.17    0.64 ^ clkbuf_leaf_5_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    15    0.04                           clknet_leaf_5_i_clk (net)
                  0.06    0.00    0.64 ^ _3343_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.74   clock uncertainty
                         -0.06    0.68   clock reconvergence pessimism
                         -0.03    0.65   library hold time
                                  0.65   data required time
-----------------------------------------------------------------------------
                                  0.65   data required time
                                 -0.99   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3346_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3346_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17    0.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17    0.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.43 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15    0.58 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00    0.58 ^ _3346_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.30    0.88 ^ _3346_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[12] (net)
                  0.06    0.00    0.88 ^ _2865_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.99 ^ _2865_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0216_ (net)
                  0.04    0.00    0.99 ^ _3346_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.99   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.28 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.28 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.19    0.47 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00    0.47 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.17    0.64 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00    0.64 ^ _3346_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.74   clock uncertainty
                         -0.06    0.68   clock reconvergence pessimism
                         -0.03    0.65   library hold time
                                  0.65   data required time
-----------------------------------------------------------------------------
                                  0.65   data required time
                                 -0.99   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3315_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3315_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17    0.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.25 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.44 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.11    0.00    0.44 ^ clkbuf_leaf_12_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.15    0.59 ^ clkbuf_leaf_12_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_12_i_clk (net)
                  0.05    0.00    0.59 ^ _3315_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.31    0.90 ^ _3315_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net83 (net)
                  0.07    0.00    0.90 ^ _2790_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    1.00 ^ _2790_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0186_ (net)
                  0.03    0.00    1.00 ^ _3315_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.00   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.28 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.28 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.20    0.48 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.11    0.00    0.49 ^ clkbuf_leaf_12_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.17    0.65 ^ clkbuf_leaf_12_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_12_i_clk (net)
                  0.05    0.00    0.66 ^ _3315_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.76   clock uncertainty
                         -0.06    0.69   clock reconvergence pessimism
                         -0.03    0.67   library hold time
                                  0.67   data required time
-----------------------------------------------------------------------------
                                  0.67   data required time
                                 -1.00   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3291_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.01    6.69 v _2748_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.29    6.98 v _2748_/X (sky130_fd_sc_hd__a221o_1)
     1    0.00                           _0963_ (net)
                  0.06    0.00    6.98 v _2749_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.11    7.10 v _2749_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0162_ (net)
                  0.04    0.00    7.10 v _3291_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.10   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17   20.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00   20.43 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15   20.58 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00   20.58 ^ _3291_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.48   clock uncertainty
                          0.00   20.48   clock reconvergence pessimism
                         -0.10   20.38   library setup time
                                 20.38   data required time
-----------------------------------------------------------------------------
                                 20.38   data required time
                                 -7.10   data arrival time
-----------------------------------------------------------------------------
                                 13.28   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3292_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.01    6.69 v _2750_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.29    6.98 v _2750_/X (sky130_fd_sc_hd__a221o_1)
     1    0.00                           _0964_ (net)
                  0.06    0.00    6.98 v _2751_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.11    7.09 v _2751_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0163_ (net)
                  0.04    0.00    7.09 v _3292_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.09   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17   20.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00   20.43 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15   20.58 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00   20.58 ^ _3292_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.48   clock uncertainty
                          0.00   20.48   clock reconvergence pessimism
                         -0.10   20.38   library setup time
                                 20.38   data required time
-----------------------------------------------------------------------------
                                 20.38   data required time
                                 -7.09   data arrival time
-----------------------------------------------------------------------------
                                 13.29   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3298_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.00    6.69 v _2762_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.30    6.99 v _2762_/X (sky130_fd_sc_hd__a221o_1)
     1    0.01                           _0970_ (net)
                  0.06    0.00    6.99 v _2763_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.12    7.11 v _2763_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0169_ (net)
                  0.04    0.00    7.11 v _3298_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.11   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.44 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.11    0.00   20.44 ^ clkbuf_leaf_13_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.07    0.17   20.61 ^ clkbuf_leaf_13_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    18    0.05                           clknet_leaf_13_i_clk (net)
                  0.07    0.00   20.61 ^ _3298_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.51   clock uncertainty
                          0.00   20.51   clock reconvergence pessimism
                         -0.10   20.41   library setup time
                                 20.41   data required time
-----------------------------------------------------------------------------
                                 20.41   data required time
                                 -7.11   data arrival time
-----------------------------------------------------------------------------
                                 13.30   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3296_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.00    6.69 v _2758_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.29    6.98 v _2758_/X (sky130_fd_sc_hd__a221o_1)
     1    0.00                           _0968_ (net)
                  0.06    0.00    6.98 v _2759_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.11    7.09 v _2759_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0167_ (net)
                  0.04    0.00    7.09 v _3296_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.09   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.44 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.11    0.00   20.44 ^ clkbuf_leaf_11_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.16   20.60 ^ clkbuf_leaf_11_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_11_i_clk (net)
                  0.06    0.00   20.60 ^ _3296_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.50   clock uncertainty
                          0.00   20.50   clock reconvergence pessimism
                         -0.10   20.39   library setup time
                                 20.39   data required time
-----------------------------------------------------------------------------
                                 20.39   data required time
                                 -7.09   data arrival time
-----------------------------------------------------------------------------
                                 13.30   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3295_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.01    6.69 v _2756_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.29    6.98 v _2756_/X (sky130_fd_sc_hd__a221o_1)
     1    0.00                           _0967_ (net)
                  0.06    0.00    6.98 v _2757_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.11    7.09 v _2757_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0166_ (net)
                  0.04    0.00    7.09 v _3295_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.09   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.44 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.11    0.00   20.44 ^ clkbuf_leaf_11_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.16   20.60 ^ clkbuf_leaf_11_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_11_i_clk (net)
                  0.06    0.00   20.60 ^ _3295_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.50   clock uncertainty
                          0.00   20.50   clock reconvergence pessimism
                         -0.11   20.39   library setup time
                                 20.39   data required time
-----------------------------------------------------------------------------
                                 20.39   data required time
                                 -7.09   data arrival time
-----------------------------------------------------------------------------
                                 13.30   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3291_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.01                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.01    4.19 v _1609_/A (sky130_fd_sc_hd__or2_1)
                  0.05    0.24    4.44 v _1609_/X (sky130_fd_sc_hd__or2_1)
     1    0.00                           _1265_ (net)
                  0.05    0.00    4.44 v _1610_/A (sky130_fd_sc_hd__buf_2)
                  0.08    0.18    4.61 v _1610_/X (sky130_fd_sc_hd__buf_2)
     9    0.03                           _1266_ (net)
                  0.08    0.00    4.62 v _1671_/C (sky130_fd_sc_hd__or4b_1)
                  0.11    0.53    5.15 v _1671_/X (sky130_fd_sc_hd__or4b_1)
     3    0.01                           _1327_ (net)
                  0.11    0.00    5.15 v _1672_/A (sky130_fd_sc_hd__and3_1)
                  0.07    0.21    5.36 v _1672_/X (sky130_fd_sc_hd__and3_1)
     3    0.01                           _1328_ (net)
                  0.07    0.00    5.36 v _2741_/A_N (sky130_fd_sc_hd__and4b_1)
                  0.08    0.28    5.64 ^ _2741_/X (sky130_fd_sc_hd__and4b_1)
     1    0.01                           _0956_ (net)
                  0.08    0.00    5.64 ^ _2742_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.07    0.20    5.83 ^ _2742_/X (sky130_fd_sc_hd__o2111a_1)
     2    0.01                           _0957_ (net)
                  0.07    0.00    5.83 ^ _2746_/D_N (sky130_fd_sc_hd__or4bb_2)
                  0.14    0.63    6.46 v _2746_/X (sky130_fd_sc_hd__or4bb_2)
     2    0.02                           _0961_ (net)
                  0.14    0.00    6.46 v _2747_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    6.68 v _2747_/X (sky130_fd_sc_hd__buf_8)
    30    0.10                           _0962_ (net)
                  0.08    0.01    6.69 v _2748_/C1 (sky130_fd_sc_hd__a221o_1)
                  0.06    0.29    6.98 v _2748_/X (sky130_fd_sc_hd__a221o_1)
     1    0.00                           _0963_ (net)
                  0.06    0.00    6.98 v _2749_/B1 (sky130_fd_sc_hd__o21a_1)
                  0.04    0.11    7.10 v _2749_/X (sky130_fd_sc_hd__o21a_1)
     1    0.00                           _0162_ (net)
                  0.04    0.00    7.10 v _3291_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.10   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.12    0.08   20.08 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.12    0.00   20.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.17   20.25 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00   20.25 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.10    0.17   20.43 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.08                           clknet_2_1__leaf_i_clk (net)
                  0.10    0.00   20.43 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.06    0.15   20.58 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    14    0.04                           clknet_leaf_7_i_clk (net)
                  0.06    0.00   20.58 ^ _3291_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.48   clock uncertainty
                          0.00   20.48   clock reconvergence pessimism
                         -0.10   20.38   library setup time
                                 20.38   data required time
-----------------------------------------------------------------------------
                                 20.38   data required time
                                 -7.10   data arrival time
-----------------------------------------------------------------------------
                                 13.28   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 13.28

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.33
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3252_/CLK ^
   0.66
_3288_/CLK ^
   0.43     -0.03       0.21

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             6.00e-04   4.59e-05   2.37e-09   6.46e-04  40.9%
Combinational          5.21e-04   4.12e-04   7.35e-09   9.33e-04  59.1%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.12e-03   4.58e-04   9.72e-09   1.58e-03 100.0%
                          71.0%      29.0%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 23030 u^2 45% utilization.
area_report_end
