OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/routing/15-resizer_timing.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 3133 components and 18793 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 11088 connections.
[INFO ODB-0133]     Created 2306 nets and 7705 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/routing/15-resizer_timing.def
###############################################################################
# Created by write_sdc
# Sun Aug 24 19:32:34 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 6.4500 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_propagated_clock [get_clocks {i_clk}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
-congestion_iterations 50 -verbose
[INFO GRT-0020] Min routing layer: met1
[INFO GRT-0021] Max routing layer: met5
[INFO GRT-0022] Global adjustment: 30%
[INFO GRT-0023] Grid origin: (0, 0)
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0088] Layer li1     Track-Pitch = 0.4600  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met1    Track-Pitch = 0.3400  line-2-Via Pitch: 0.3400
[INFO GRT-0088] Layer met2    Track-Pitch = 0.4600  line-2-Via Pitch: 0.3500
[INFO GRT-0088] Layer met3    Track-Pitch = 0.6800  line-2-Via Pitch: 0.6150
[INFO GRT-0088] Layer met4    Track-Pitch = 0.9200  line-2-Via Pitch: 1.0400
[INFO GRT-0088] Layer met5    Track-Pitch = 3.4000  line-2-Via Pitch: 3.1100
[INFO GRT-0019] Found 46 clock nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 31
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3920

[INFO GRT-0053] Routing resources analysis:
          Routing      Original      Derated      Resource
Layer     Direction    Resources     Resources    Reduction (%)
---------------------------------------------------------------
li1        Vertical            0             0          0.00%
met1       Horizontal      24480         12640          48.37%
met2       Vertical        18360         11470          37.53%
met3       Horizontal      12240          7711          37.00%
met4       Vertical         7344          4585          37.57%
met5       Horizontal       2448          1155          52.82%
---------------------------------------------------------------

[INFO GRT-0101] Running extra iterations to remove overflow.
[INFO GRT-0197] Via related to pin nodes: 10618
[INFO GRT-0198] Via related Steiner nodes: 338
[INFO GRT-0199] Via filling finished.
[INFO GRT-0111] Final number of vias: 12297
[INFO GRT-0112] Final usage 3D: 48999

[INFO GRT-0096] Final congestion report:
Layer         Resource        Demand        Usage (%)    Max H / Max V / Total Overflow
---------------------------------------------------------------------------------------
li1                  0             0            0.00%             0 /  0 /  0
met1             12640          5690           45.02%             0 /  0 /  0
met2             11470          5030           43.85%             0 /  0 /  0
met3              7711           768            9.96%             0 /  0 /  0
met4              4585           620           13.52%             0 /  0 /  0
met5              1155             0            0.00%             0 /  0 /  0
---------------------------------------------------------------------------------------
Total            37561         12108           32.24%             0 /  0 /  0

[INFO GRT-0018] Total wirelength: 128305 um
[INFO GRT-0014] Routed nets: 2306
[INFO GRT-0006] Repairing antennas, iteration 1.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 6
[INFO GRT-0015] Inserted 6 diodes.
[INFO GRT-0009] rerouting 1624 nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 31
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3920
[INFO GRT-0006] Repairing antennas, iteration 2.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 5
[INFO GRT-0015] Inserted 5 diodes.
[INFO GRT-0009] rerouting 21 nets.
[INFO GRT-0001] Minimum degree: 2
[INFO GRT-0002] Maximum degree: 19
[INFO GRT-0003] Macros: 0
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VGND has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[WARNING GRT-0040] Net VPWR has wires outside die area.
[INFO GRT-0004] Blockages: 3920
[INFO GRT-0006] Repairing antennas, iteration 3.
[INFO GRT-0043] No OR_DEFAULT vias defined.
[INFO GRT-0012] Antenna violations: 0
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.20    0.47 ^ clkbuf_2_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_0__leaf_i_clk (net)
                  0.11    0.00    0.47 ^ clkbuf_leaf_39_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_39_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_39_i_clk (net)
                  0.05    0.00    0.63 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.32    0.95 ^ _3718_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           reset_counter[4] (net)
                  0.06    0.00    0.95 ^ _2934_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.04    0.10    1.06 ^ _2934_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0093_ (net)
                  0.04    0.00    1.06 ^ _3718_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.06   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.20    0.47 ^ clkbuf_2_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_0__leaf_i_clk (net)
                  0.11    0.00    0.47 ^ clkbuf_leaf_39_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_39_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_39_i_clk (net)
                  0.05    0.00    0.63 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                          0.00    0.73   clock reconvergence pessimism
                         -0.03    0.70   library hold time
                                  0.70   data required time
-----------------------------------------------------------------------------
                                  0.70   data required time
                                 -1.06   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3838_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3838_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.66 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.05    0.00    0.66 ^ _3838_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.97 ^ _3838_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[8] (net)
                  0.05    0.00    0.97 ^ _3339_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    1.08 ^ _3339_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0212_ (net)
                  0.04    0.00    1.08 ^ _3838_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.08   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.66 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.05    0.00    0.66 ^ _3838_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.76   clock uncertainty
                          0.00    0.76   clock reconvergence pessimism
                         -0.03    0.73   library hold time
                                  0.73   data required time
-----------------------------------------------------------------------------
                                  0.73   data required time
                                 -1.08   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3842_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3842_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_10_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.66 ^ clkbuf_leaf_10_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_10_i_clk (net)
                  0.04    0.00    0.66 ^ _3842_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.97 ^ _3842_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[12] (net)
                  0.05    0.00    0.97 ^ _3343_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    1.08 ^ _3343_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0216_ (net)
                  0.04    0.00    1.08 ^ _3842_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.08   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_10_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.66 ^ clkbuf_leaf_10_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_10_i_clk (net)
                  0.04    0.00    0.66 ^ _3842_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.76   clock uncertainty
                          0.00    0.76   clock reconvergence pessimism
                         -0.03    0.73   library hold time
                                  0.73   data required time
-----------------------------------------------------------------------------
                                  0.73   data required time
                                 -1.08   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3799_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3799_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_6_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.17    0.67 ^ clkbuf_leaf_6_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.03                           clknet_leaf_6_i_clk (net)
                  0.05    0.00    0.67 ^ _3799_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.99 ^ _3799_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net93 (net)
                  0.07    0.00    0.99 ^ _3235_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    1.10 ^ _3235_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0174_ (net)
                  0.03    0.00    1.10 ^ _3799_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.10   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.01    0.50 ^ clkbuf_leaf_6_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.17    0.67 ^ clkbuf_leaf_6_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.03                           clknet_leaf_6_i_clk (net)
                  0.05    0.00    0.67 ^ _3799_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.77   clock uncertainty
                          0.00    0.77   clock reconvergence pessimism
                         -0.03    0.74   library hold time
                                  0.74   data required time
-----------------------------------------------------------------------------
                                  0.74   data required time
                                 -1.10   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


Startpoint: _3853_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3853_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_17_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_17_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_17_i_clk (net)
                  0.05    0.00    0.63 ^ _3853_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.31    0.94 ^ _3853_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[23] (net)
                  0.06    0.00    0.94 ^ _3354_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    1.06 ^ _3354_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0227_ (net)
                  0.04    0.00    1.06 ^ _3853_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.06   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.09    0.09 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.09 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_17_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_17_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_17_i_clk (net)
                  0.05    0.00    0.63 ^ _3853_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                          0.00    0.73   clock reconvergence pessimism
                         -0.03    0.70   library hold time
                                  0.70   data required time
-----------------------------------------------------------------------------
                                  0.70   data required time
                                 -1.06   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3792_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.01    3.58 v _3219_/S (sky130_fd_sc_hd__mux2_1)
                  0.06    0.32    3.90 v _3219_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0167_ (net)
                  0.06    0.00    3.90 v _3792_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.90   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3792_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.90   data arrival time
-----------------------------------------------------------------------------
                                  2.97   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3791_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.01    3.58 v _3217_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.32    3.90 v _3217_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0166_ (net)
                  0.05    0.00    3.90 v _3791_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.90   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3791_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.90   data arrival time
-----------------------------------------------------------------------------
                                  2.97   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3811_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.01    3.58 v _3259_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.32    3.90 v _3259_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0186_ (net)
                  0.05    0.00    3.90 v _3811_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.90   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3811_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.90   data arrival time
-----------------------------------------------------------------------------
                                  2.97   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3796_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.00    3.57 v _3227_/S (sky130_fd_sc_hd__mux2_1)
                  0.06    0.32    3.89 v _3227_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0171_ (net)
                  0.06    0.00    3.89 v _3796_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.89   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_18_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_18_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_18_i_clk (net)
                  0.05    0.00    7.08 ^ _3796_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.89   data arrival time
-----------------------------------------------------------------------------
                                  2.97   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3795_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.00    3.57 v _3225_/S (sky130_fd_sc_hd__mux2_1)
                  0.06    0.32    3.89 v _3225_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0170_ (net)
                  0.06    0.00    3.89 v _3795_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.89   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_18_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_18_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_18_i_clk (net)
                  0.05    0.00    7.08 ^ _3795_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.89   data arrival time
-----------------------------------------------------------------------------
                                  2.98   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3792_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.03    0.02    1.31 ^ i_wb_we (in)
     1    0.01                           i_wb_we (net)
                  0.03    0.00    1.31 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.48 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.48 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.73 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.01    1.73 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.07    0.09    1.82 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.07    0.00    1.82 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.17    0.16    1.99 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.17    0.00    1.99 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.12    2.11 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.11 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.26    2.37 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.37 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.88 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.88 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.33    0.29    3.17 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.33    0.00    3.17 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.15    0.17    3.35 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.01    3.35 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.09    0.22    3.57 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.09    0.01    3.58 v _3219_/S (sky130_fd_sc_hd__mux2_1)
                  0.06    0.32    3.90 v _3219_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0167_ (net)
                  0.06    0.00    3.90 v _3792_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.90   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.09    6.54 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.54 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3792_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.90   data arrival time
-----------------------------------------------------------------------------
                                  2.97   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 2.97

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.35
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3699_/CLK ^
   0.67
_3628_/CLK ^
   0.47      0.00       0.20

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             1.86e-03   1.14e-04   2.37e-09   1.97e-03  40.1%
Combinational          1.68e-03   1.28e-03   7.05e-09   2.95e-03  59.9%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  3.54e-03   1.39e-03   9.42e-09   4.93e-03 100.0%
                          71.8%      28.2%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 21438 u^2 42% utilization.
area_report_end
