OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/10ns_threshold_min_area/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/10ns_threshold_min_area/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/10ns_threshold_min_area/tmp/placement/7-global.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 2158 components and 13945 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 7762 connections.
[INFO ODB-0133]     Created 1654 nets and 6183 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/10ns_threshold_min_area/tmp/placement/7-global.def
###############################################################################
# Created by write_sdc
# Mon Aug 25 02:38:00 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 10.0000 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 2.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting RC values...
[INFO RSZ-0027] Inserted 60 input buffers.
[INFO RSZ-0028] Inserted 43 output buffers.
[INFO RSZ-0058] Using max wire length 3048um.
[INFO RSZ-0039] Resized 1487 instances.
Placement Analysis
---------------------------------
total displacement      14272.0 u
average displacement        6.3 u
max displacement          143.8 u
original HPWL           46214.0 u
legalized HPWL          66058.5 u
delta HPWL                   43 %

[INFO DPL-0020] Mirrored 669 instances
[INFO DPL-0021] HPWL before           66058.5 u
[INFO DPL-0022] HPWL after            64764.6 u
[INFO DPL-0023] HPWL delta               -2.0 %
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _2651_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _2651_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _2651_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.33    0.33 ^ _2651_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.r_input[30] (net)
                  0.05    0.00    0.33 ^ _1608_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.44 ^ _1608_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0034_ (net)
                  0.04    0.00    0.44 ^ _2651_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.44   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _2651_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.44   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


Startpoint: _2649_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _2649_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _2649_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.33    0.33 ^ _2649_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.r_input[28] (net)
                  0.05    0.00    0.33 ^ _1604_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.44 ^ _1604_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0032_ (net)
                  0.04    0.00    0.44 ^ _2649_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.44   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _2649_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.44   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


Startpoint: _2650_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _2650_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _2650_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.33    0.33 ^ _2650_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.r_input[29] (net)
                  0.06    0.00    0.33 ^ _1606_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.45 ^ _1606_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0033_ (net)
                  0.04    0.00    0.45 ^ _2650_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _2650_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


Startpoint: _2837_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _2837_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _2837_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.33    0.33 ^ _2837_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[15] (net)
                  0.06    0.00    0.33 ^ _2383_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.45 ^ _2383_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0219_ (net)
                  0.04    0.00    0.45 ^ _2837_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _2837_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


Startpoint: _2752_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _2752_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _2752_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.33    0.33 ^ _2752_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           spif_data[8] (net)
                  0.06    0.00    0.33 ^ _2232_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.45 ^ _2232_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0135_ (net)
                  0.04    0.00    0.45 ^ _2752_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _2752_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2742_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2155_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.06    4.95 v _2155_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _0674_ (net)
                  0.06    0.00    4.95 v _2172_/B (sky130_fd_sc_hd__nor2_1)
                  0.20    0.18    5.13 ^ _2172_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0691_ (net)
                  0.20    0.00    5.13 ^ _2216_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.07    0.10    5.23 v _2216_/Y (sky130_fd_sc_hd__o21ai_1)
     1    0.00                           _0732_ (net)
                  0.07    0.00    5.23 v _2217_/B2 (sky130_fd_sc_hd__o22a_1)
                  0.04    0.15    5.38 v _2217_/X (sky130_fd_sc_hd__o22a_1)
     1    0.00                           _0125_ (net)
                  0.04    0.00    5.38 v _2742_/D (sky130_fd_sc_hd__dfxtp_2)
                                  5.38   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2742_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    9.80   library setup time
                                  9.80   data required time
-----------------------------------------------------------------------------
                                  9.80   data required time
                                 -5.38   data arrival time
-----------------------------------------------------------------------------
                                  4.42   slack (MET)


Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2741_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2155_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.06    4.95 v _2155_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _0674_ (net)
                  0.06    0.00    4.95 v _2172_/B (sky130_fd_sc_hd__nor2_1)
                  0.20    0.18    5.13 ^ _2172_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0691_ (net)
                  0.20    0.00    5.13 ^ _2208_/A1_N (sky130_fd_sc_hd__o2bb2a_1)
                  0.05    0.23    5.36 v _2208_/X (sky130_fd_sc_hd__o2bb2a_1)
     1    0.00                           _0124_ (net)
                  0.05    0.00    5.36 v _2741_/D (sky130_fd_sc_hd__dfxtp_2)
                                  5.36   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2741_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    9.80   library setup time
                                  9.80   data required time
-----------------------------------------------------------------------------
                                  9.80   data required time
                                 -5.36   data arrival time
-----------------------------------------------------------------------------
                                  4.44   slack (MET)


Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2739_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2155_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.06    4.95 v _2155_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _0674_ (net)
                  0.06    0.00    4.95 v _2172_/B (sky130_fd_sc_hd__nor2_1)
                  0.20    0.18    5.13 ^ _2172_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0691_ (net)
                  0.20    0.00    5.13 ^ _2178_/B1 (sky130_fd_sc_hd__o311a_1)
                  0.05    0.19    5.32 ^ _2178_/X (sky130_fd_sc_hd__o311a_1)
     1    0.00                           _0697_ (net)
                  0.05    0.00    5.32 ^ _2179_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.09    5.41 ^ _2179_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0122_ (net)
                  0.04    0.00    5.41 ^ _2739_/D (sky130_fd_sc_hd__dfxtp_1)
                                  5.41   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2739_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.04    9.86   library setup time
                                  9.86   data required time
-----------------------------------------------------------------------------
                                  9.86   data required time
                                 -5.41   data arrival time
-----------------------------------------------------------------------------
                                  4.44   slack (MET)


Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2740_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2155_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.06    4.95 v _2155_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _0674_ (net)
                  0.06    0.00    4.95 v _2172_/B (sky130_fd_sc_hd__nor2_1)
                  0.20    0.18    5.13 ^ _2172_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0691_ (net)
                  0.20    0.00    5.13 ^ _2197_/A (sky130_fd_sc_hd__nand2_1)
                  0.06    0.08    5.20 v _2197_/Y (sky130_fd_sc_hd__nand2_1)
     1    0.00                           _0715_ (net)
                  0.06    0.00    5.20 v _2198_/B1 (sky130_fd_sc_hd__o211a_1)
                  0.04    0.12    5.32 v _2198_/X (sky130_fd_sc_hd__o211a_1)
     1    0.00                           _0123_ (net)
                  0.04    0.00    5.32 v _2740_/D (sky130_fd_sc_hd__dfxtp_1)
                                  5.32   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2740_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.09    9.81   library setup time
                                  9.81   data required time
-----------------------------------------------------------------------------
                                  9.81   data required time
                                 -5.32   data arrival time
-----------------------------------------------------------------------------
                                  4.48   slack (MET)


Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2743_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2223_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    5.24 v _2223_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0126_ (net)
                  0.05    0.00    5.24 v _2743_/D (sky130_fd_sc_hd__dfxtp_1)
                                  5.24   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2743_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    9.80   library setup time
                                  9.80   data required time
-----------------------------------------------------------------------------
                                  9.80   data required time
                                 -5.24   data arrival time
-----------------------------------------------------------------------------
                                  4.56   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_data_stb (input port clocked by i_clk)
Endpoint: _2742_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          2.00    2.00 ^ input external delay
                  0.03    0.02    2.02 ^ i_wb_data_stb (in)
     1    0.01                           i_wb_data_stb (net)
                  0.03    0.00    2.02 ^ input59/A (sky130_fd_sc_hd__clkbuf_1)
                  0.13    0.14    2.16 ^ input59/X (sky130_fd_sc_hd__clkbuf_1)
     1    0.01                           net59 (net)
                  0.13    0.00    2.16 ^ _1327_/A (sky130_fd_sc_hd__buf_6)
                  0.16    0.21    2.37 ^ _1327_/X (sky130_fd_sc_hd__buf_6)
    22    0.08                           _0991_ (net)
                  0.16    0.01    2.37 ^ _1396_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.48 v _1396_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _1060_ (net)
                  0.08    0.00    2.48 v _1727_/C (sky130_fd_sc_hd__and3_1)
                  0.05    0.20    2.68 v _1727_/X (sky130_fd_sc_hd__and3_1)
     2    0.01                           _0327_ (net)
                  0.05    0.00    2.68 v _2145_/B1 (sky130_fd_sc_hd__a2bb2o_1)
                  0.05    0.27    2.95 v _2145_/X (sky130_fd_sc_hd__a2bb2o_1)
     1    0.00                           _0664_ (net)
                  0.05    0.00    2.95 v _2147_/B1 (sky130_fd_sc_hd__a311o_1)
                  0.05    0.31    3.26 v _2147_/X (sky130_fd_sc_hd__a311o_1)
     1    0.00                           _0666_ (net)
                  0.05    0.00    3.26 v _2150_/B (sky130_fd_sc_hd__or4_1)
                  0.08    0.49    3.75 v _2150_/X (sky130_fd_sc_hd__or4_1)
     1    0.00                           _0669_ (net)
                  0.08    0.00    3.75 v _2151_/B1 (sky130_fd_sc_hd__a211o_1)
                  0.06    0.28    4.03 v _2151_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _0670_ (net)
                  0.06    0.00    4.03 v _2152_/C (sky130_fd_sc_hd__or4b_1)
                  0.12    0.52    4.55 v _2152_/X (sky130_fd_sc_hd__or4b_1)
     1    0.01                           _0671_ (net)
                  0.12    0.00    4.55 v _2154_/B1 (sky130_fd_sc_hd__a211oi_4)
                  0.30    0.34    4.89 ^ _2154_/Y (sky130_fd_sc_hd__a211oi_4)
     5    0.02                           _0673_ (net)
                  0.30    0.00    4.89 ^ _2155_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.06    4.95 v _2155_/Y (sky130_fd_sc_hd__inv_2)
     2    0.01                           _0674_ (net)
                  0.06    0.00    4.95 v _2172_/B (sky130_fd_sc_hd__nor2_1)
                  0.20    0.18    5.13 ^ _2172_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0691_ (net)
                  0.20    0.00    5.13 ^ _2216_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.07    0.10    5.23 v _2216_/Y (sky130_fd_sc_hd__o21ai_1)
     1    0.00                           _0732_ (net)
                  0.07    0.00    5.23 v _2217_/B2 (sky130_fd_sc_hd__o22a_1)
                  0.04    0.15    5.38 v _2217_/X (sky130_fd_sc_hd__o22a_1)
     1    0.00                           _0125_ (net)
                  0.04    0.00    5.38 v _2742_/D (sky130_fd_sc_hd__dfxtp_2)
                                  5.38   data arrival time

                  0.10   10.00   10.00   clock i_clk (rise edge)
                          0.00   10.00   clock network delay (ideal)
                         -0.10    9.90   clock uncertainty
                          0.00    9.90   clock reconvergence pessimism
                                  9.90 ^ _2742_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    9.80   library setup time
                                  9.80   data required time
-----------------------------------------------------------------------------
                                  9.80   data required time
                                 -5.38   data arrival time
-----------------------------------------------------------------------------
                                  4.42   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 4.42

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.36
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_2619_/CLK ^
   1.71
_2619_/CLK ^
   1.71      0.00       0.00

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             1.19e-03   7.66e-05   2.37e-09   1.27e-03  69.3%
Combinational          2.96e-04   2.65e-04   5.39e-09   5.62e-04  30.7%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.49e-03   3.42e-04   7.75e-09   1.83e-03 100.0%
                          81.3%      18.7%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 18544 u^2 59% utilization.
area_report_end
