OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/results/placement/wbqspiflash.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 2605 components and 17323 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 9398 connections.
[INFO ODB-0133]     Created 2013 nets and 7925 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/20ns_full_tighter_timing/results/placement/wbqspiflash.def
###############################################################################
# Created by write_sdc
# Thu Aug 21 22:56:00 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 20.0000 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 4.0000 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting RC values...
[INFO]: Configuring cts characterization...
[INFO]: Performing clock tree synthesis...
[INFO]: Looking for the following net(s): i_clk
[INFO]: Running Clock Tree Synthesis...
[INFO CTS-0049] Characterization buffer is: sky130_fd_sc_hd__clkbuf_8.
[INFO CTS-0038] Number of created patterns = 50000.
[INFO CTS-0038] Number of created patterns = 100000.
[INFO CTS-0039] Number of created patterns = 137808.
[INFO CTS-0084] Compiling LUT.
Min. len    Max. len    Min. cap    Max. cap    Min. slew   Max. slew
2           8           1           35          1           48          
[WARNING CTS-0043] 4752 wires are pure wire and no slew degradation.
TritonCTS forced slew degradation on these wires.
[INFO CTS-0046]     Number of wire segments: 137808.
[INFO CTS-0047]     Number of keys in characterization LUT: 1760.
[INFO CTS-0048]     Actual min input cap: 1.
[INFO CTS-0007] Net "i_clk" found for clock "i_clk".
[INFO CTS-0010]  Clock net "i_clk" has 280 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 2 buffer(s) types.
[INFO CTS-0027] Generating H-Tree topology for net i_clk.
[INFO CTS-0028]  Total number of sinks: 280.
[INFO CTS-0029]  Sinks will be clustered in groups of up to 12 and with maximum cluster diameter of 30.0 um.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 13000  dbu (13 um).
[INFO CTS-0019]  Total number of sinks after clustering: 57.
[INFO CTS-0024]  Normalized sink region: [(1.61269, 2.03769), (15.0535, 15.1677)].
[INFO CTS-0025]     Width:  13.4408.
[INFO CTS-0026]     Height: 13.1300.
 Level 1
    Direction: Horizontal
    Sinks per sub-region: 29
    Sub-region size: 6.7204 X 13.1300
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 72 outSlew: 2 load: 1 length: 4 isBuffered: false
 Level 2
    Direction: Vertical
    Sinks per sub-region: 15
    Sub-region size: 6.7204 X 6.5650
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 72 outSlew: 2 load: 1 length: 4 isBuffered: false
[WARNING CTS-0045] Creating fake entries in the LUT.
 Level 3
    Direction: Horizontal
    Sinks per sub-region: 8
    Sub-region size: 3.3602 X 6.5650
[INFO CTS-0034]     Segment length (rounded): 1.
    Key: 137811 outSlew: 3 load: 1 length: 1 isBuffered: false
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 57.
[INFO CTS-0036]  Average source sink dist: 16887.33 dbu.
[INFO CTS-0037]  Number of outlier sinks: 0.
[INFO CTS-0018]     Created 63 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 2.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 3.
[INFO CTS-0015]     Created 63 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 2:8, 3:4, 4:9, 5:10, 6:10, 7:9, 8:11, 9:1..
[INFO CTS-0017]     Max level of the clock tree: 3.
[INFO CTS-0098] Clock net "i_clk"
[INFO CTS-0099]  Sinks 280
[INFO CTS-0100]  Leaf buffers 54
[INFO CTS-0101]  Average sink wire length 314.69 um
[INFO CTS-0102]  Path depth 2 - 3
[INFO]: Repairing long wires on clock nets...
[INFO RSZ-0058] Using max wire length 3048um.
[INFO]: Legalizing...
Placement Analysis
---------------------------------
total displacement       1173.8 u
average displacement        0.4 u
max displacement           12.3 u
original HPWL           77883.5 u
legalized HPWL          80124.9 u
delta HPWL                    3 %

[INFO DPL-0020] Mirrored 826 instances
[INFO DPL-0021] HPWL before           80124.9 u
[INFO DPL-0022] HPWL after            78287.5 u
[INFO DPL-0023] HPWL delta               -2.3 %
cts_report
[INFO CTS-0003] Total number of Clock Roots: 1.
[INFO CTS-0004] Total number of Buffers Inserted: 63.
[INFO CTS-0005] Total number of Clock Subnets: 63.
[INFO CTS-0006] Total number of Sinks: 280.
cts_report_end
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3358_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3358_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.26 ^ clkbuf_3_6__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.18    0.44 ^ clkbuf_3_6__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_6__leaf_i_clk (net)
                  0.08    0.00    0.44 ^ clkbuf_leaf_25_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13    0.57 ^ clkbuf_leaf_25_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     5    0.01                           clknet_leaf_25_i_clk (net)
                  0.04    0.00    0.57 ^ _3358_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.29    0.86 ^ _3358_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[24] (net)
                  0.05    0.00    0.86 ^ _2877_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.96 ^ _2877_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0228_ (net)
                  0.04    0.00    0.96 ^ _3358_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.96   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.22    0.29 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.29 ^ clkbuf_3_6__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.20    0.49 ^ clkbuf_3_6__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_6__leaf_i_clk (net)
                  0.08    0.00    0.49 ^ clkbuf_leaf_25_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.14    0.63 ^ clkbuf_leaf_25_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     5    0.01                           clknet_leaf_25_i_clk (net)
                  0.04    0.00    0.63 ^ _3358_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                         -0.06    0.67   clock reconvergence pessimism
                         -0.03    0.64   library hold time
                                  0.64   data required time
-----------------------------------------------------------------------------
                                  0.64   data required time
                                 -0.96   data arrival time
-----------------------------------------------------------------------------
                                  0.32   slack (MET)


Startpoint: _3311_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3311_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.26 ^ clkbuf_3_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.07    0.17    0.43 ^ clkbuf_3_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.05                           clknet_3_3__leaf_i_clk (net)
                  0.07    0.00    0.43 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.12    0.56 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.02                           clknet_leaf_16_i_clk (net)
                  0.04    0.00    0.56 ^ _3311_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.30    0.86 ^ _3311_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net72 (net)
                  0.06    0.00    0.86 ^ _2782_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    0.95 ^ _2782_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0182_ (net)
                  0.03    0.00    0.95 ^ _3311_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.95   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.22    0.29 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.29 ^ clkbuf_3_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.07    0.18    0.48 ^ clkbuf_3_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.05                           clknet_3_3__leaf_i_clk (net)
                  0.07    0.00    0.48 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.14    0.62 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.02                           clknet_leaf_16_i_clk (net)
                  0.04    0.00    0.62 ^ _3311_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.72   clock uncertainty
                         -0.06    0.66   clock reconvergence pessimism
                         -0.03    0.63   library hold time
                                  0.63   data required time
-----------------------------------------------------------------------------
                                  0.63   data required time
                                 -0.95   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


Startpoint: _3360_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3360_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.26 ^ clkbuf_3_7__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.18    0.44 ^ clkbuf_3_7__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.06                           clknet_3_7__leaf_i_clk (net)
                  0.08    0.00    0.44 ^ clkbuf_leaf_28_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13    0.57 ^ clkbuf_leaf_28_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_28_i_clk (net)
                  0.04    0.00    0.57 ^ _3360_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.29    0.86 ^ _3360_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[26] (net)
                  0.05    0.00    0.86 ^ _2879_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    0.96 ^ _2879_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0230_ (net)
                  0.04    0.00    0.96 ^ _3360_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.96   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.22    0.29 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.29 ^ clkbuf_3_7__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.49 ^ clkbuf_3_7__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.06                           clknet_3_7__leaf_i_clk (net)
                  0.08    0.00    0.49 ^ clkbuf_leaf_28_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.14    0.63 ^ clkbuf_leaf_28_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_28_i_clk (net)
                  0.04    0.00    0.63 ^ _3360_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                         -0.06    0.67   clock reconvergence pessimism
                         -0.03    0.64   library hold time
                                  0.64   data required time
-----------------------------------------------------------------------------
                                  0.64   data required time
                                 -0.96   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


Startpoint: _3312_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3312_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.26 ^ clkbuf_3_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.07    0.17    0.43 ^ clkbuf_3_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.05                           clknet_3_3__leaf_i_clk (net)
                  0.07    0.00    0.43 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.12    0.56 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.02                           clknet_leaf_16_i_clk (net)
                  0.04    0.00    0.56 ^ _3312_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.30    0.86 ^ _3312_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net73 (net)
                  0.07    0.00    0.86 ^ _2784_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.09    0.95 ^ _2784_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0183_ (net)
                  0.03    0.00    0.95 ^ _3312_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.95   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.22    0.29 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.29 ^ clkbuf_3_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.07    0.18    0.48 ^ clkbuf_3_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.05                           clknet_3_3__leaf_i_clk (net)
                  0.07    0.00    0.48 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.14    0.62 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     6    0.02                           clknet_leaf_16_i_clk (net)
                  0.04    0.00    0.62 ^ _3312_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.72   clock uncertainty
                         -0.06    0.66   clock reconvergence pessimism
                         -0.03    0.63   library hold time
                                  0.63   data required time
-----------------------------------------------------------------------------
                                  0.63   data required time
                                 -0.95   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


Startpoint: _3315_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3315_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19    0.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.26 ^ clkbuf_3_6__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.18    0.44 ^ clkbuf_3_6__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_6__leaf_i_clk (net)
                  0.08    0.00    0.44 ^ clkbuf_leaf_24_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13    0.57 ^ clkbuf_leaf_24_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     5    0.01                           clknet_leaf_24_i_clk (net)
                  0.04    0.00    0.57 ^ _3315_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.30    0.87 ^ _3315_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net83 (net)
                  0.07    0.00    0.87 ^ _2790_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.09    0.97 ^ _2790_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0186_ (net)
                  0.03    0.00    0.97 ^ _3315_/D (sky130_fd_sc_hd__dfxtp_1)
                                  0.97   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.10    0.07    0.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00    0.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.22    0.29 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00    0.29 ^ clkbuf_3_6__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.20    0.49 ^ clkbuf_3_6__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_6__leaf_i_clk (net)
                  0.08    0.00    0.49 ^ clkbuf_leaf_24_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.14    0.63 ^ clkbuf_leaf_24_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     5    0.01                           clknet_leaf_24_i_clk (net)
                  0.04    0.00    0.63 ^ _3315_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                         -0.06    0.67   clock reconvergence pessimism
                         -0.03    0.64   library hold time
                                  0.64   data required time
-----------------------------------------------------------------------------
                                  0.64   data required time
                                 -0.97   data arrival time
-----------------------------------------------------------------------------
                                  0.33   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3264_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.01    6.83 ^ _2702_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.36    7.19 v _2702_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0135_ (net)
                  0.05    0.00    7.19 v _3264_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.19   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13   20.57 ^ clkbuf_leaf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_0_i_clk (net)
                  0.04    0.00   20.57 ^ _3264_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.47   clock uncertainty
                          0.00   20.47   clock reconvergence pessimism
                         -0.12   20.36   library setup time
                                 20.36   data required time
-----------------------------------------------------------------------------
                                 20.36   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 13.17   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3272_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.00    6.83 ^ _2710_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.17 v _2710_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0143_ (net)
                  0.05    0.00    7.17 v _3272_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.17   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_4_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.03    0.12   20.56 ^ clkbuf_leaf_4_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     2    0.00                           clknet_leaf_4_i_clk (net)
                  0.03    0.00   20.56 ^ _3272_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.46   clock uncertainty
                          0.00   20.46   clock reconvergence pessimism
                         -0.12   20.34   library setup time
                                 20.34   data required time
-----------------------------------------------------------------------------
                                 20.34   data required time
                                 -7.17   data arrival time
-----------------------------------------------------------------------------
                                 13.17   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3271_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.01    6.83 ^ _2709_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.18 v _2709_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0142_ (net)
                  0.05    0.00    7.18 v _3271_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.18   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_3_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13   20.57 ^ clkbuf_leaf_3_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     5    0.01                           clknet_leaf_3_i_clk (net)
                  0.04    0.00   20.57 ^ _3271_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   20.47   clock uncertainty
                          0.00   20.47   clock reconvergence pessimism
                         -0.12   20.35   library setup time
                                 20.35   data required time
-----------------------------------------------------------------------------
                                 20.35   data required time
                                 -7.18   data arrival time
-----------------------------------------------------------------------------
                                 13.17   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3263_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.01    6.83 ^ _2701_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.18 v _2701_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0134_ (net)
                  0.05    0.00    7.18 v _3263_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.18   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13   20.57 ^ clkbuf_leaf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_0_i_clk (net)
                  0.04    0.00   20.57 ^ _3263_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   20.47   clock uncertainty
                          0.00   20.47   clock reconvergence pessimism
                         -0.12   20.36   library setup time
                                 20.36   data required time
-----------------------------------------------------------------------------
                                 20.36   data required time
                                 -7.18   data arrival time
-----------------------------------------------------------------------------
                                 13.18   slack (MET)


Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3261_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.01    6.83 ^ _2699_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.35    7.18 v _2699_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0132_ (net)
                  0.05    0.00    7.18 v _3261_/D (sky130_fd_sc_hd__dfxtp_2)
                                  7.18   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_56_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13   20.58 ^ clkbuf_leaf_56_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_56_i_clk (net)
                  0.04    0.00   20.58 ^ _3261_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10   20.48   clock uncertainty
                          0.00   20.48   clock reconvergence pessimism
                         -0.12   20.36   library setup time
                                 20.36   data required time
-----------------------------------------------------------------------------
                                 20.36   data required time
                                 -7.18   data arrival time
-----------------------------------------------------------------------------
                                 13.18   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_addr[1] (input port clocked by i_clk)
Endpoint: _3264_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          4.00    4.00 v input external delay
                  0.01    0.01    4.01 v i_wb_addr[1] (in)
     1    0.00                           i_wb_addr[1] (net)
                  0.01    0.00    4.01 v input16/A (sky130_fd_sc_hd__buf_4)
                  0.08    0.18    4.19 v input16/X (sky130_fd_sc_hd__buf_4)
    12    0.05                           net16 (net)
                  0.08    0.00    4.19 v _1753_/B1_N (sky130_fd_sc_hd__o21bai_1)
                  0.09    0.20    4.39 v _1753_/Y (sky130_fd_sc_hd__o21bai_1)
     1    0.01                           _1408_ (net)
                  0.09    0.00    4.39 v _1754_/B1 (sky130_fd_sc_hd__o21ai_1)
                  0.21    0.15    4.54 ^ _1754_/Y (sky130_fd_sc_hd__o21ai_1)
     2    0.01                           _1409_ (net)
                  0.21    0.00    4.54 ^ _1761_/B1 (sky130_fd_sc_hd__o2111ai_1)
                  0.16    0.20    4.74 v _1761_/Y (sky130_fd_sc_hd__o2111ai_1)
     1    0.01                           _1416_ (net)
                  0.16    0.00    4.74 v _1762_/C (sky130_fd_sc_hd__nor3_1)
                  0.36    0.35    5.09 ^ _1762_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1417_ (net)
                  0.36    0.00    5.09 ^ _1763_/D1 (sky130_fd_sc_hd__o2111a_1)
                  0.11    0.30    5.39 ^ _1763_/X (sky130_fd_sc_hd__o2111a_1)
     1    0.01                           _1418_ (net)
                  0.11    0.00    5.39 ^ _1827_/B (sky130_fd_sc_hd__nand4_4)
                  0.14    0.15    5.54 v _1827_/Y (sky130_fd_sc_hd__nand4_4)
     5    0.02                           _1482_ (net)
                  0.14    0.00    5.55 v _2546_/A2 (sky130_fd_sc_hd__o211a_1)
                  0.09    0.30    5.85 v _2546_/X (sky130_fd_sc_hd__o211a_1)
     2    0.01                           _0824_ (net)
                  0.09    0.00    5.85 v _2581_/B (sky130_fd_sc_hd__nor4b_4)
                  0.66    0.66    6.51 ^ _2581_/Y (sky130_fd_sc_hd__nor4b_4)
     9    0.05                           _0838_ (net)
                  0.66    0.00    6.51 ^ _2582_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.31    6.82 ^ _2582_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _0839_ (net)
                  0.19    0.01    6.83 ^ _2702_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.36    7.19 v _2702_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0135_ (net)
                  0.05    0.00    7.19 v _3264_/D (sky130_fd_sc_hd__dfxtp_1)
                                  7.19   data arrival time

                         20.00   20.00   clock i_clk (rise edge)
                          0.00   20.00   clock source latency
                  0.10    0.07   20.07 ^ i_clk (in)
     1    0.02                           i_clk (net)
                  0.10    0.00   20.07 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.11    0.19   20.26 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.10                           clknet_0_i_clk (net)
                  0.11    0.00   20.26 ^ clkbuf_3_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.09    0.18   20.44 ^ clkbuf_3_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.07                           clknet_3_0__leaf_i_clk (net)
                  0.09    0.00   20.44 ^ clkbuf_leaf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.13   20.57 ^ clkbuf_leaf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     7    0.02                           clknet_leaf_0_i_clk (net)
                  0.04    0.00   20.57 ^ _3264_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10   20.47   clock uncertainty
                          0.00   20.47   clock reconvergence pessimism
                         -0.12   20.36   library setup time
                                 20.36   data required time
-----------------------------------------------------------------------------
                                 20.36   data required time
                                 -7.19   data arrival time
-----------------------------------------------------------------------------
                                 13.17   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 13.17

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.32
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3203_/CLK ^
   0.64
_3164_/CLK ^
   0.43     -0.03       0.18

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             6.02e-04   4.12e-05   2.37e-09   6.43e-04  35.9%
Combinational          7.40e-04   4.10e-04   7.55e-09   1.15e-03  64.1%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  1.34e-03   4.51e-04   9.92e-09   1.79e-03 100.0%
                          74.8%      25.2%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 23115 u^2 62% utilization.
area_report_end
