OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/floorplan/6-pdn.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 2985 components and 17905 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 10496 connections.
[INFO ODB-0133]     Created 2158 nets and 7409 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/floorplan/6-pdn.def
[INFO]: Setting RC values...
[INFO]: Setting signal min routing layer to: met1 and clock min routing layer to met1. 
[INFO]: Setting signal max routing layer to: met5 and clock max routing layer to met5. 
[INFO GPL-0002] DBU: 1000
[INFO GPL-0003] SiteSize: 460 2720
[INFO GPL-0004] CoreAreaLxLy: 5520 10880
[INFO GPL-0005] CoreAreaUxUy: 231840 236640
[INFO GPL-0006] NumInstances: 2985
[INFO GPL-0007] NumPlaceInstances: 2097
[INFO GPL-0008] NumFixedInstances: 888
[INFO GPL-0009] NumDummyInstances: 0
[INFO GPL-0010] NumNets: 2158
[INFO GPL-0011] NumPins: 7513
[INFO GPL-0012] DieAreaLxLy: 0 0
[INFO GPL-0013] DieAreaUxUy: 237810 248530
[INFO GPL-0014] CoreAreaLxLy: 5520 10880
[INFO GPL-0015] CoreAreaUxUy: 231840 236640
[INFO GPL-0016] CoreArea: 51094003200
[INFO GPL-0017] NonPlaceInstsArea: 1526464000
[INFO GPL-0018] PlaceInstsArea: 20569728000
[INFO GPL-0019] Util(%): 41.50
[INFO GPL-0020] StdInstsArea: 20569728000
[INFO GPL-0021] MacroInstsArea: 0
[InitialPlace]  Iter: 1 CG residual: 0.00000009 HPWL: 43249300
[InitialPlace]  Iter: 2 CG residual: 0.00000012 HPWL: 35742644
[InitialPlace]  Iter: 3 CG residual: 0.00000009 HPWL: 35598194
[InitialPlace]  Iter: 4 CG residual: 0.00000010 HPWL: 35569913
[InitialPlace]  Iter: 5 CG residual: 0.00000008 HPWL: 35484943
[INFO GPL-0031] FillerInit: NumGCells: 2123
[INFO GPL-0032] FillerInit: NumGNets: 2158
[INFO GPL-0033] FillerInit: NumGPins: 7513
[INFO GPL-0023] TargetDensity: 0.42
[INFO GPL-0024] AveragePlaceInstArea: 9809121
[INFO GPL-0025] IdealBinArea: 23355050
[INFO GPL-0026] IdealBinCnt: 2187
[INFO GPL-0027] TotalBinArea: 51094003200
[INFO GPL-0028] BinCnt: 32 32
[INFO GPL-0029] BinSize: 7073 7055
[INFO GPL-0030] NumBins: 1024
[NesterovSolve] Iter: 1 overflow: 0.933954 HPWL: 25435221
[NesterovSolve] Iter: 10 overflow: 0.784059 HPWL: 34315710
[INFO GPL-0100] worst slack 2.65e-09
[INFO GPL-0103] Weighted 216 nets.
[NesterovSolve] Iter: 20 overflow: 0.786696 HPWL: 34383539
[NesterovSolve] Iter: 30 overflow: 0.780352 HPWL: 34342733
[NesterovSolve] Iter: 40 overflow: 0.782791 HPWL: 34245321
[NesterovSolve] Iter: 50 overflow: 0.782061 HPWL: 34170831
[NesterovSolve] Iter: 60 overflow: 0.781585 HPWL: 34128109
[NesterovSolve] Iter: 70 overflow: 0.779973 HPWL: 34105843
[NesterovSolve] Iter: 80 overflow: 0.778754 HPWL: 34098924
[NesterovSolve] Iter: 90 overflow: 0.778536 HPWL: 34102787
[NesterovSolve] Iter: 100 overflow: 0.778912 HPWL: 34107494
[NesterovSolve] Iter: 110 overflow: 0.779324 HPWL: 34123351
[NesterovSolve] Iter: 120 overflow: 0.77975 HPWL: 34144454
[NesterovSolve] Iter: 130 overflow: 0.779631 HPWL: 34177859
[NesterovSolve] Iter: 140 overflow: 0.778731 HPWL: 34236510
[NesterovSolve] Iter: 150 overflow: 0.777182 HPWL: 34334983
[NesterovSolve] Iter: 160 overflow: 0.774766 HPWL: 34490591
[NesterovSolve] Iter: 170 overflow: 0.770931 HPWL: 34736077
[NesterovSolve] Iter: 180 overflow: 0.766275 HPWL: 35127552
[NesterovSolve] Iter: 190 overflow: 0.757864 HPWL: 35707228
[NesterovSolve] Iter: 200 overflow: 0.748539 HPWL: 36566550
[NesterovSolve] Iter: 210 overflow: 0.732101 HPWL: 37757514
[NesterovSolve] Iter: 220 overflow: 0.714899 HPWL: 39250644
[NesterovSolve] Iter: 230 overflow: 0.688117 HPWL: 41097754
[NesterovSolve] Iter: 240 overflow: 0.661978 HPWL: 42991961
[INFO GPL-0100] worst slack 2.54e-09
[INFO GPL-0103] Weighted 216 nets.
[NesterovSolve] Iter: 250 overflow: 0.627881 HPWL: 45024675
[NesterovSolve] Snapshot saved at iter = 256
[NesterovSolve] Iter: 260 overflow: 0.587254 HPWL: 46899425
[NesterovSolve] Iter: 270 overflow: 0.543335 HPWL: 48741783
[NesterovSolve] Iter: 280 overflow: 0.497159 HPWL: 50672730
[INFO GPL-0100] worst slack 2.58e-09
[INFO GPL-0103] Weighted 216 nets.
[NesterovSolve] Iter: 290 overflow: 0.452414 HPWL: 52366032
[NesterovSolve] Iter: 300 overflow: 0.403305 HPWL: 54495783
[NesterovSolve] Iter: 310 overflow: 0.358345 HPWL: 56504920
[NesterovSolve] Iter: 320 overflow: 0.314958 HPWL: 57721125
[INFO GPL-0100] worst slack 2.46e-09
[INFO GPL-0103] Weighted 215 nets.
[NesterovSolve] Iter: 330 overflow: 0.278079 HPWL: 58783915
[NesterovSolve] Iter: 340 overflow: 0.240978 HPWL: 59765854
[NesterovSolve] Iter: 350 overflow: 0.207831 HPWL: 60566800
[INFO GPL-0100] worst slack 2.56e-09
[INFO GPL-0103] Weighted 216 nets.
[INFO GPL-0075] Routability numCall: 1 inflationIterCnt: 1 bloatIterCnt: 0
[INFO GPL-0036] TileLxLy: 0 0
[INFO GPL-0037] TileSize: 6900 6900
[INFO GPL-0038] TileCnt: 34 36
[INFO GPL-0039] numRoutingLayers: 6
[INFO GPL-0040] NumTiles: 1224
[INFO GPL-0063] TotalRouteOverflowH2: 0.0
[INFO GPL-0064] TotalRouteOverflowV2: 2.3333334922790527
[INFO GPL-0065] OverflowTileCnt2: 18
[INFO GPL-0066] 0.5%RC: 1.161111096541087
[INFO GPL-0067] 1.0%RC: 1.0972222288449605
[INFO GPL-0068] 2.0%RC: 1.0496453934527459
[INFO GPL-0069] 5.0%RC: 1.0201149438989574
[INFO GPL-0070] 0.5rcK: 1.0
[INFO GPL-0071] 1.0rcK: 1.0
[INFO GPL-0072] 2.0rcK: 0.0
[INFO GPL-0073] 5.0rcK: 0.0
[INFO GPL-0074] FinalRC: 1.1291666
[NesterovSolve] Iter: 360 overflow: 0.179097 HPWL: 61213043
[NesterovSolve] Iter: 370 overflow: 0.152518 HPWL: 61709964
[INFO GPL-0100] worst slack 2.55e-09
[INFO GPL-0103] Weighted 215 nets.
[NesterovSolve] Iter: 380 overflow: 0.129183 HPWL: 62125910
[NesterovSolve] Iter: 390 overflow: 0.110393 HPWL: 62467562
[NesterovSolve] Finished with Overflow: 0.099772
###############################################################################
# Created by write_sdc
# Sun Aug 24 19:31:34 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 6.4500 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting RC values...
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.04    0.33    0.33 ^ _3718_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.00                           reset_counter[4] (net)
                  0.04    0.00    0.33 ^ _2934_/A1 (sky130_fd_sc_hd__a21o_2)
                  0.02    0.10    0.43 ^ _2934_/X (sky130_fd_sc_hd__a21o_2)
     1    0.00                           _0093_ (net)
                  0.02    0.00    0.43 ^ _3718_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.43   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.43   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3723_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3723_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3723_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.04    0.35    0.35 v _3723_/Q (sky130_fd_sc_hd__dfxtp_2)
     3    0.01                           reset_counter[9] (net)
                  0.04    0.00    0.35 v _2946_/B1 (sky130_fd_sc_hd__o21ai_2)
                  0.05    0.05    0.40 ^ _2946_/Y (sky130_fd_sc_hd__o21ai_2)
     1    0.00                           _0951_ (net)
                  0.05    0.00    0.40 ^ _2947_/A (sky130_fd_sc_hd__nand2_2)
                  0.02    0.03    0.43 v _2947_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _0098_ (net)
                  0.02    0.00    0.43 v _3723_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.43   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3723_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.43   data arrival time
-----------------------------------------------------------------------------
                                  0.36   slack (MET)


Startpoint: _3717_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3786_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3717_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.05    0.34    0.34 ^ _3717_/Q (sky130_fd_sc_hd__dfxtp_2)
     2    0.01                           reset_counter[3] (net)
                  0.05    0.00    0.34 ^ _3195_/B (sky130_fd_sc_hd__or3_2)
                  0.03    0.11    0.45 ^ _3195_/X (sky130_fd_sc_hd__or3_2)
     1    0.00                           _0161_ (net)
                  0.03    0.00    0.45 ^ _3786_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3786_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


Startpoint: _3877_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3877_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3877_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.05    0.34    0.34 ^ _3877_/Q (sky130_fd_sc_hd__dfxtp_2)
     3    0.01                           lldriver.r_word[12] (net)
                  0.05    0.00    0.34 ^ _3461_/B1 (sky130_fd_sc_hd__a32o_2)
                  0.04    0.10    0.45 ^ _3461_/X (sky130_fd_sc_hd__a32o_2)
     1    0.00                           _0251_ (net)
                  0.04    0.00    0.45 ^ _3877_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3877_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


Startpoint: _3897_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3897_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                  0.10    0.00    0.00 ^ _3897_/CLK (sky130_fd_sc_hd__dfxtp_2)
                  0.07    0.36    0.36 ^ _3897_/Q (sky130_fd_sc_hd__dfxtp_2)
     3    0.01                           lldriver.r_word[0] (net)
                  0.07    0.00    0.36 ^ _3577_/B (sky130_fd_sc_hd__nand2_2)
                  0.03    0.05    0.41 v _3577_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1409_ (net)
                  0.03    0.00    0.41 v _3578_/B1 (sky130_fd_sc_hd__o21ai_2)
                  0.03    0.04    0.45 ^ _3578_/Y (sky130_fd_sc_hd__o21ai_2)
     1    0.00                           _0271_ (net)
                  0.03    0.00    0.45 ^ _3897_/D (sky130_fd_sc_hd__dfxtp_2)
                                  0.45   data arrival time

                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          0.10    0.10   clock uncertainty
                          0.00    0.10   clock reconvergence pessimism
                                  0.10 ^ _3897_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.02    0.08   library hold time
                                  0.08   data required time
-----------------------------------------------------------------------------
                                  0.08   data required time
                                 -0.45   data arrival time
-----------------------------------------------------------------------------
                                  0.37   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3747_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 ^ input external delay
                  0.08    0.05    1.34 ^ i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.08    0.00    1.34 ^ _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.35    0.33    1.68 ^ _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.35    0.00    1.68 ^ _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.16    0.20    1.88 v _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.16    0.00    1.88 v _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.40    0.35    2.23 ^ _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.09                           _1507_ (net)
                  0.40    0.00    2.23 ^ _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.23    2.46 ^ _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.46 ^ _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.04    0.15    2.61 ^ _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.04    0.00    2.61 ^ _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.16    0.29    2.90 ^ _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.16    0.00    2.91 ^ _2368_/B (sky130_fd_sc_hd__nand3_2)
                  0.16    0.16    3.07 v _2368_/Y (sky130_fd_sc_hd__nand3_2)
     4    0.02                           _0434_ (net)
                  0.16    0.00    3.07 v _3025_/A (sky130_fd_sc_hd__nand2_2)
                  0.07    0.11    3.18 ^ _3025_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1006_ (net)
                  0.07    0.00    3.18 ^ _3028_/A (sky130_fd_sc_hd__nand2_2)
                  0.03    0.05    3.22 v _3028_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1009_ (net)
                  0.03    0.00    3.22 v _3029_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.27 ^ _3029_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1010_ (net)
                  0.05    0.00    3.27 ^ _3031_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.32 v _3031_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1012_ (net)
                  0.04    0.00    3.32 v _3033_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.37 ^ _3033_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1014_ (net)
                  0.05    0.00    3.37 ^ _3035_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.42 v _3035_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1016_ (net)
                  0.04    0.00    3.42 v _3038_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.47 ^ _3038_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1019_ (net)
                  0.05    0.00    3.47 ^ _3039_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.52 v _3039_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1020_ (net)
                  0.04    0.00    3.52 v _3042_/A (sky130_fd_sc_hd__nand2_2)
                  0.06    0.05    3.57 ^ _3042_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1023_ (net)
                  0.06    0.00    3.57 ^ _3046_/A (sky130_fd_sc_hd__nand3_2)
                  0.08    0.06    3.63 v _3046_/Y (sky130_fd_sc_hd__nand3_2)
     1    0.01                           _1027_ (net)
                  0.08    0.00    3.63 v _3048_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.07    3.70 ^ _3048_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1029_ (net)
                  0.05    0.00    3.70 ^ _3049_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.75 v _3049_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1030_ (net)
                  0.05    0.00    3.75 v _3085_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.06    3.81 ^ _3085_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1066_ (net)
                  0.05    0.00    3.81 ^ _3087_/A (sky130_fd_sc_hd__nand2_2)
                  0.03    0.04    3.85 v _3087_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _0122_ (net)
                  0.03    0.00    3.85 v _3747_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.85   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3747_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.09    6.26   library setup time
                                  6.26   data required time
-----------------------------------------------------------------------------
                                  6.26   data required time
                                 -3.85   data arrival time
-----------------------------------------------------------------------------
                                  2.41   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3628_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 ^ input external delay
                  0.08    0.05    1.34 ^ i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.08    0.00    1.34 ^ _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.35    0.33    1.68 ^ _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.35    0.00    1.68 ^ _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.16    0.20    1.88 v _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.16    0.00    1.88 v _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.40    0.35    2.23 ^ _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.09                           _1507_ (net)
                  0.40    0.00    2.23 ^ _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.23    2.46 ^ _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.46 ^ _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.04    0.15    2.61 ^ _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.04    0.00    2.61 ^ _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.16    0.29    2.90 ^ _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.16    0.00    2.91 ^ _2108_/B (sky130_fd_sc_hd__nand2_2)
                  0.07    0.07    2.98 v _2108_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1737_ (net)
                  0.07    0.00    2.98 v _2112_/A2 (sky130_fd_sc_hd__o21ai_2)
                  0.15    0.17    3.14 ^ _2112_/Y (sky130_fd_sc_hd__o21ai_2)
     2    0.01                           _1741_ (net)
                  0.15    0.00    3.14 ^ _2133_/A1 (sky130_fd_sc_hd__a21o_2)
                  0.04    0.15    3.29 ^ _2133_/X (sky130_fd_sc_hd__a21o_2)
     1    0.01                           _1762_ (net)
                  0.04    0.00    3.29 ^ _2138_/A (sky130_fd_sc_hd__nand3_2)
                  0.05    0.05    3.34 v _2138_/Y (sky130_fd_sc_hd__nand3_2)
     1    0.00                           _1767_ (net)
                  0.05    0.00    3.34 v _2150_/A1 (sky130_fd_sc_hd__a21o_2)
                  0.04    0.19    3.53 v _2150_/X (sky130_fd_sc_hd__a21o_2)
     1    0.00                           _1779_ (net)
                  0.04    0.00    3.53 v _2154_/A (sky130_fd_sc_hd__nand2_2)
                  0.06    0.06    3.59 ^ _2154_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1783_ (net)
                  0.06    0.00    3.59 ^ _2182_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.04    3.63 v _2182_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _0282_ (net)
                  0.04    0.00    3.63 v _2191_/A1 (sky130_fd_sc_hd__a21o_2)
                  0.03    0.17    3.80 v _2191_/X (sky130_fd_sc_hd__a21o_2)
     1    0.00                           _0003_ (net)
                  0.03    0.00    3.80 v _3628_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.80   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3628_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.09    6.26   library setup time
                                  6.26   data required time
-----------------------------------------------------------------------------
                                  6.26   data required time
                                 -3.80   data arrival time
-----------------------------------------------------------------------------
                                  2.46   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3753_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 v input external delay
                  0.04    0.03    1.32 v i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.04    0.00    1.32 v _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.23    1.55 v _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.16    0.00    1.55 v _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.18    0.21    1.76 ^ _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.18    0.00    1.76 ^ _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.19    0.21    1.97 v _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.08                           _1507_ (net)
                  0.19    0.00    1.97 v _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.27    2.23 v _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.23 v _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.03    0.16    2.39 v _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.03    0.00    2.39 v _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.09    0.23    2.62 v _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.09    0.00    2.62 v _2958_/A2 (sky130_fd_sc_hd__a311o_2)
                  0.08    0.42    3.04 v _2958_/X (sky130_fd_sc_hd__a311o_2)
     2    0.01                           _0962_ (net)
                  0.08    0.00    3.04 v _3018_/B (sky130_fd_sc_hd__nand2_4)
                  0.14    0.16    3.20 ^ _3018_/Y (sky130_fd_sc_hd__nand2_4)
     9    0.05                           _1001_ (net)
                  0.14    0.00    3.20 ^ _3019_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.23    3.43 ^ _3019_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _1002_ (net)
                  0.19    0.01    3.44 ^ _3143_/S (sky130_fd_sc_hd__mux2_2)
                  0.04    0.35    3.78 v _3143_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _0128_ (net)
                  0.04    0.00    3.78 v _3753_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.78   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3753_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    6.25   library setup time
                                  6.25   data required time
-----------------------------------------------------------------------------
                                  6.25   data required time
                                 -3.78   data arrival time
-----------------------------------------------------------------------------
                                  2.47   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3752_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 v input external delay
                  0.04    0.03    1.32 v i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.04    0.00    1.32 v _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.23    1.55 v _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.16    0.00    1.55 v _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.18    0.21    1.76 ^ _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.18    0.00    1.76 ^ _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.19    0.21    1.97 v _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.08                           _1507_ (net)
                  0.19    0.00    1.97 v _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.27    2.23 v _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.23 v _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.03    0.16    2.39 v _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.03    0.00    2.39 v _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.09    0.23    2.62 v _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.09    0.00    2.62 v _2958_/A2 (sky130_fd_sc_hd__a311o_2)
                  0.08    0.42    3.04 v _2958_/X (sky130_fd_sc_hd__a311o_2)
     2    0.01                           _0962_ (net)
                  0.08    0.00    3.04 v _3018_/B (sky130_fd_sc_hd__nand2_4)
                  0.14    0.16    3.20 ^ _3018_/Y (sky130_fd_sc_hd__nand2_4)
     9    0.05                           _1001_ (net)
                  0.14    0.00    3.20 ^ _3019_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.23    3.43 ^ _3019_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _1002_ (net)
                  0.19    0.01    3.44 ^ _3142_/S (sky130_fd_sc_hd__mux2_2)
                  0.04    0.35    3.78 v _3142_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _0127_ (net)
                  0.04    0.00    3.78 v _3752_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.78   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3752_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    6.25   library setup time
                                  6.25   data required time
-----------------------------------------------------------------------------
                                  6.25   data required time
                                 -3.78   data arrival time
-----------------------------------------------------------------------------
                                  2.47   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3755_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 v input external delay
                  0.04    0.03    1.32 v i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.04    0.00    1.32 v _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.16    0.23    1.55 v _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.16    0.00    1.55 v _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.18    0.21    1.76 ^ _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.18    0.00    1.76 ^ _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.19    0.21    1.97 v _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.08                           _1507_ (net)
                  0.19    0.00    1.97 v _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.27    2.23 v _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.23 v _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.03    0.16    2.39 v _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.03    0.00    2.39 v _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.09    0.23    2.62 v _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.09    0.00    2.62 v _2958_/A2 (sky130_fd_sc_hd__a311o_2)
                  0.08    0.42    3.04 v _2958_/X (sky130_fd_sc_hd__a311o_2)
     2    0.01                           _0962_ (net)
                  0.08    0.00    3.04 v _3018_/B (sky130_fd_sc_hd__nand2_4)
                  0.14    0.16    3.20 ^ _3018_/Y (sky130_fd_sc_hd__nand2_4)
     9    0.05                           _1001_ (net)
                  0.14    0.00    3.20 ^ _3019_/A (sky130_fd_sc_hd__buf_8)
                  0.19    0.23    3.43 ^ _3019_/X (sky130_fd_sc_hd__buf_8)
    26    0.12                           _1002_ (net)
                  0.19    0.01    3.44 ^ _3145_/S (sky130_fd_sc_hd__mux2_2)
                  0.04    0.35    3.78 v _3145_/X (sky130_fd_sc_hd__mux2_2)
     1    0.00                           _0130_ (net)
                  0.04    0.00    3.78 v _3755_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.78   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3755_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.10    6.25   library setup time
                                  6.25   data required time
-----------------------------------------------------------------------------
                                  6.25   data required time
                                 -3.78   data arrival time
-----------------------------------------------------------------------------
                                  2.47   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3747_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                  0.10    0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (ideal)
                          1.29    1.29 ^ input external delay
                  0.08    0.05    1.34 ^ i_wb_we (in)
     1    0.02                           i_wb_we (net)
                  0.08    0.00    1.34 ^ _1875_/A (sky130_fd_sc_hd__buf_2)
                  0.35    0.33    1.68 ^ _1875_/X (sky130_fd_sc_hd__buf_2)
    14    0.07                           _1505_ (net)
                  0.35    0.00    1.68 ^ _1876_/B (sky130_fd_sc_hd__nand2_2)
                  0.16    0.20    1.88 v _1876_/Y (sky130_fd_sc_hd__nand2_2)
     8    0.03                           _1506_ (net)
                  0.16    0.00    1.88 v _1877_/A (sky130_fd_sc_hd__inv_2)
                  0.40    0.35    2.23 ^ _1877_/Y (sky130_fd_sc_hd__inv_2)
    21    0.09                           _1507_ (net)
                  0.40    0.00    2.23 ^ _2100_/C (sky130_fd_sc_hd__and3_2)
                  0.04    0.23    2.46 ^ _2100_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1729_ (net)
                  0.04    0.00    2.46 ^ _2101_/A (sky130_fd_sc_hd__and3_2)
                  0.04    0.15    2.61 ^ _2101_/X (sky130_fd_sc_hd__and3_2)
     1    0.00                           _1730_ (net)
                  0.04    0.00    2.61 ^ _2107_/A (sky130_fd_sc_hd__and4_2)
                  0.16    0.29    2.90 ^ _2107_/X (sky130_fd_sc_hd__and4_2)
     4    0.03                           _1736_ (net)
                  0.16    0.00    2.91 ^ _2368_/B (sky130_fd_sc_hd__nand3_2)
                  0.16    0.16    3.07 v _2368_/Y (sky130_fd_sc_hd__nand3_2)
     4    0.02                           _0434_ (net)
                  0.16    0.00    3.07 v _3025_/A (sky130_fd_sc_hd__nand2_2)
                  0.07    0.11    3.18 ^ _3025_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1006_ (net)
                  0.07    0.00    3.18 ^ _3028_/A (sky130_fd_sc_hd__nand2_2)
                  0.03    0.05    3.22 v _3028_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1009_ (net)
                  0.03    0.00    3.22 v _3029_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.27 ^ _3029_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1010_ (net)
                  0.05    0.00    3.27 ^ _3031_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.32 v _3031_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1012_ (net)
                  0.04    0.00    3.32 v _3033_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.37 ^ _3033_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1014_ (net)
                  0.05    0.00    3.37 ^ _3035_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.42 v _3035_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1016_ (net)
                  0.04    0.00    3.42 v _3038_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.47 ^ _3038_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1019_ (net)
                  0.05    0.00    3.47 ^ _3039_/A (sky130_fd_sc_hd__nand2_2)
                  0.04    0.05    3.52 v _3039_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1020_ (net)
                  0.04    0.00    3.52 v _3042_/A (sky130_fd_sc_hd__nand2_2)
                  0.06    0.05    3.57 ^ _3042_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1023_ (net)
                  0.06    0.00    3.57 ^ _3046_/A (sky130_fd_sc_hd__nand3_2)
                  0.08    0.06    3.63 v _3046_/Y (sky130_fd_sc_hd__nand3_2)
     1    0.01                           _1027_ (net)
                  0.08    0.00    3.63 v _3048_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.07    3.70 ^ _3048_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _1029_ (net)
                  0.05    0.00    3.70 ^ _3049_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.05    3.75 v _3049_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1030_ (net)
                  0.05    0.00    3.75 v _3085_/A (sky130_fd_sc_hd__nand2_2)
                  0.05    0.06    3.81 ^ _3085_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.01                           _1066_ (net)
                  0.05    0.00    3.81 ^ _3087_/A (sky130_fd_sc_hd__nand2_2)
                  0.03    0.04    3.85 v _3087_/Y (sky130_fd_sc_hd__nand2_2)
     1    0.00                           _0122_ (net)
                  0.03    0.00    3.85 v _3747_/D (sky130_fd_sc_hd__dfxtp_2)
                                  3.85   data arrival time

                  0.10    6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock network delay (ideal)
                         -0.10    6.35   clock uncertainty
                          0.00    6.35   clock reconvergence pessimism
                                  6.35 ^ _3747_/CLK (sky130_fd_sc_hd__dfxtp_2)
                         -0.09    6.26   library setup time
                                  6.26   data required time
-----------------------------------------------------------------------------
                                  6.26   data required time
                                 -3.85   data arrival time
-----------------------------------------------------------------------------
                                  2.41   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 2.41

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.35
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3627_/CLK ^
   1.71
_3627_/CLK ^
   1.71      0.00       0.00

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             1.87e-03   1.14e-04   2.36e-09   1.99e-03  62.5%
Combinational          6.02e-04   5.89e-04   6.46e-09   1.19e-03  37.5%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  2.48e-03   7.02e-04   8.83e-09   3.18e-03 100.0%
                          77.9%      22.1%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 22096 u^2 43% utilization.
area_report_end
