OpenROAD v2.0-4194-g9d55eaa0c 
This program is licensed under the BSD-3 license. See the LICENSE file for details.
Components of this program may be licensed under more restrictive licenses which must be honored.
[INFO ODB-0222] Reading LEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0223]     Created 13 technology layers
[INFO ODB-0224]     Created 25 technology vias
[INFO ODB-0225]     Created 441 library cells
[INFO ODB-0226] Finished LEF file:  /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/tmp/merged.unpadded.nom.lef
[INFO ODB-0127] Reading DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/results/placement/wbqspiflash.def
[INFO ODB-0128] Design: wbqspiflash
[INFO ODB-0130]     Created 106 pins.
[INFO ODB-0131]     Created 3088 components and 18523 component-terminals.
[INFO ODB-0132]     Created 2 special nets and 10908 connections.
[INFO ODB-0133]     Created 2261 nets and 7615 connections.
[INFO ODB-0134] Finished DEF file: /home/opentools/OpenLane/designs/wbqspiflash/runs/6.45ns_threshold_area_full/results/placement/wbqspiflash.def
###############################################################################
# Created by write_sdc
# Sun Aug 24 19:31:46 2025
###############################################################################
current_design wbqspiflash
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name i_clk -period 6.4500 [get_ports {i_clk}]
set_clock_transition 0.1000 [get_clocks {i_clk}]
set_clock_uncertainty 0.1000 i_clk
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_qspi_dat[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_addr[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_ctrl_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_cyc}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[0]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[10]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[11]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[12]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[13]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[14]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[15]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[16]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[17]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[18]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[19]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[1]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[20]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[21]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[22]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[23]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[24]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[25]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[26]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[27]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[28]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[29]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[2]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[30]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[31]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[3]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[4]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[5]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[6]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[7]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[8]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data[9]}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_data_stb}]
set_input_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {i_wb_we}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_interrupt}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_cs_n}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_dat[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_mod[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_qspi_sck}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_ack}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[0]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[10]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[11]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[12]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[13]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[14]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[15]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[16]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[17]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[18]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[19]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[1]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[20]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[21]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[22]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[23]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[24]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[25]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[26]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[27]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[28]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[29]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[2]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[30]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[31]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[3]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[4]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[5]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[6]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[7]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[8]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_data[9]}]
set_output_delay 1.2900 -clock [get_clocks {i_clk}] -add_delay [get_ports {o_wb_stall}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0050 [get_ports {o_interrupt}]
set_load -pin_load 0.0050 [get_ports {o_qspi_cs_n}]
set_load -pin_load 0.0050 [get_ports {o_qspi_sck}]
set_load -pin_load 0.0050 [get_ports {o_wb_ack}]
set_load -pin_load 0.0050 [get_ports {o_wb_stall}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[3]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[2]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_dat[0]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[1]}]
set_load -pin_load 0.0050 [get_ports {o_qspi_mod[0]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[31]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[30]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[29]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[28]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[27]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[26]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[25]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[24]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[23]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[22]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[21]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[20]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[19]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[18]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[17]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[16]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[15]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[14]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[13]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[12]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[11]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[10]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[9]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[8]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[7]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[6]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[5]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[4]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[3]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[2]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[1]}]
set_load -pin_load 0.0050 [get_ports {o_wb_data[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_ctrl_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_cyc}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data_stb}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_we}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_qspi_dat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_addr[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {i_wb_data[0]}]
###############################################################################
# Design Rules
###############################################################################
set_max_fanout 30.0000 [current_design]
[INFO]: Setting RC values...
[INFO]: Configuring cts characterization...
[INFO]: Performing clock tree synthesis...
[INFO]: Looking for the following net(s): i_clk
[INFO]: Running Clock Tree Synthesis...
[INFO CTS-0049] Characterization buffer is: sky130_fd_sc_hd__clkbuf_8.
[INFO CTS-0038] Number of created patterns = 50000.
[INFO CTS-0038] Number of created patterns = 100000.
[INFO CTS-0039] Number of created patterns = 137808.
[INFO CTS-0084] Compiling LUT.
Min. len    Max. len    Min. cap    Max. cap    Min. slew   Max. slew
2           8           1           35          1           48          
[WARNING CTS-0043] 4752 wires are pure wire and no slew degradation.
TritonCTS forced slew degradation on these wires.
[INFO CTS-0046]     Number of wire segments: 137808.
[INFO CTS-0047]     Number of keys in characterization LUT: 1760.
[INFO CTS-0048]     Actual min input cap: 1.
[INFO CTS-0007] Net "i_clk" found for clock "i_clk".
[INFO CTS-0010]  Clock net "i_clk" has 280 sinks.
[INFO CTS-0008] TritonCTS found 1 clock nets.
[INFO CTS-0097] Characterization used 2 buffer(s) types.
[INFO CTS-0027] Generating H-Tree topology for net i_clk.
[INFO CTS-0028]  Total number of sinks: 280.
[INFO CTS-0029]  Sinks will be clustered in groups of up to 25 and with maximum cluster diameter of 50.0 um.
[INFO CTS-0030]  Number of static layers: 0.
[INFO CTS-0020]  Wire segment unit: 13000  dbu (13 um).
[INFO CTS-0019]  Total number of sinks after clustering: 41.
[INFO CTS-0024]  Normalized sink region: [(0.763462, 1.54), (17.4344, 17.3662)].
[INFO CTS-0025]     Width:  16.6710.
[INFO CTS-0026]     Height: 15.8262.
 Level 1
    Direction: Horizontal
    Sinks per sub-region: 21
    Sub-region size: 8.3355 X 15.8262
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 72 outSlew: 2 load: 1 length: 4 isBuffered: false
 Level 2
    Direction: Vertical
    Sinks per sub-region: 11
    Sub-region size: 8.3355 X 7.9131
[INFO CTS-0034]     Segment length (rounded): 4.
    Key: 72 outSlew: 2 load: 1 length: 4 isBuffered: false
[INFO CTS-0032]  Stop criterion found. Max number of sinks is 15.
[INFO CTS-0035]  Number of sinks covered: 41.
[INFO CTS-0036]  Average source sink dist: 24959.00 dbu.
[INFO CTS-0037]  Number of outlier sinks: 0.
[INFO CTS-0018]     Created 45 clock buffers.
[INFO CTS-0012]     Minimum number of buffers in the clock path: 2.
[INFO CTS-0013]     Maximum number of buffers in the clock path: 3.
[INFO CTS-0015]     Created 45 clock nets.
[INFO CTS-0016]     Fanout distribution for the current clock = 2:3, 3:3, 4:3, 5:4, 6:5, 7:4, 8:3, 9:9, 10:3, 11:4, 12:3..
[INFO CTS-0017]     Max level of the clock tree: 2.
[INFO CTS-0098] Clock net "i_clk"
[INFO CTS-0099]  Sinks 280
[INFO CTS-0100]  Leaf buffers 40
[INFO CTS-0101]  Average sink wire length 390.62 um
[INFO CTS-0102]  Path depth 2 - 3
[INFO]: Repairing long wires on clock nets...
[INFO RSZ-0058] Using max wire length 3048um.
[INFO]: Legalizing...
Placement Analysis
---------------------------------
total displacement        379.7 u
average displacement        0.1 u
max displacement            6.7 u
original HPWL           69928.8 u
legalized HPWL          71325.4 u
delta HPWL                    2 %

[INFO DPL-0020] Mirrored 909 instances
[INFO DPL-0021] HPWL before           71325.4 u
[INFO DPL-0022] HPWL after            69960.7 u
[INFO DPL-0023] HPWL delta               -1.9 %
cts_report
[INFO CTS-0003] Total number of Clock Roots: 1.
[INFO CTS-0004] Total number of Buffers Inserted: 45.
[INFO CTS-0005] Total number of Clock Subnets: 45.
[INFO CTS-0006] Total number of Sinks: 280.
cts_report_end
min_report

===========================================================================
report_checks -path_delay min (Hold)
============================================================================
Startpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3718_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_0__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_39_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_39_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_39_i_clk (net)
                  0.05    0.00    0.63 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.06    0.31    0.95 ^ _3718_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           reset_counter[4] (net)
                  0.06    0.00    0.95 ^ _2934_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    1.04 ^ _2934_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0093_ (net)
                  0.03    0.00    1.04 ^ _3718_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.04   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_0__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_0__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_0__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_39_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_39_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    11    0.03                           clknet_leaf_39_i_clk (net)
                  0.05    0.00    0.63 ^ _3718_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                          0.00    0.73   clock reconvergence pessimism
                         -0.03    0.70   library hold time
                                  0.70   data required time
-----------------------------------------------------------------------------
                                  0.70   data required time
                                 -1.04   data arrival time
-----------------------------------------------------------------------------
                                  0.34   slack (MET)


Startpoint: _3838_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3838_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3838_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.96 ^ _3838_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[8] (net)
                  0.05    0.00    0.96 ^ _3339_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    1.07 ^ _3339_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0212_ (net)
                  0.04    0.00    1.07 ^ _3838_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.07   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3838_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.75   clock uncertainty
                          0.00    0.75   clock reconvergence pessimism
                         -0.03    0.72   library hold time
                                  0.72   data required time
-----------------------------------------------------------------------------
                                  0.72   data required time
                                 -1.07   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3851_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3851_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    0.63 ^ _3851_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.05    0.31    0.94 ^ _3851_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.00                           lldriver.o_word[21] (net)
                  0.05    0.00    0.94 ^ _3352_/A0 (sky130_fd_sc_hd__mux2_1)
                  0.04    0.11    1.05 ^ _3352_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0225_ (net)
                  0.04    0.00    1.05 ^ _3851_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.05   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    0.47 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    0.47 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    0.63 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    0.63 ^ _3851_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.73   clock uncertainty
                          0.00    0.73   clock reconvergence pessimism
                         -0.03    0.70   library hold time
                                  0.70   data required time
-----------------------------------------------------------------------------
                                  0.70   data required time
                                 -1.05   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3801_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3801_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3801_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.97 ^ _3801_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net97 (net)
                  0.07    0.00    0.97 ^ _3239_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    1.07 ^ _3239_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0176_ (net)
                  0.03    0.00    1.07 ^ _3801_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.07   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3801_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.75   clock uncertainty
                          0.00    0.75   clock reconvergence pessimism
                         -0.03    0.73   library hold time
                                  0.73   data required time
-----------------------------------------------------------------------------
                                  0.73   data required time
                                 -1.07   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


Startpoint: _3802_ (rising edge-triggered flip-flop clocked by i_clk)
Endpoint: _3802_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: min

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3802_/CLK (sky130_fd_sc_hd__dfxtp_1)
                  0.07    0.32    0.97 ^ _3802_/Q (sky130_fd_sc_hd__dfxtp_1)
     2    0.01                           net98 (net)
                  0.07    0.00    0.97 ^ _3241_/A1 (sky130_fd_sc_hd__a21o_1)
                  0.03    0.10    1.07 ^ _3241_/X (sky130_fd_sc_hd__a21o_1)
     1    0.00                           _0177_ (net)
                  0.03    0.00    1.07 ^ _3802_/D (sky130_fd_sc_hd__dfxtp_1)
                                  1.07   data arrival time

                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock source latency
                  0.12    0.08    0.08 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    0.08 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    0.27 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    0.27 ^ clkbuf_2_1__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.14    0.22    0.49 ^ clkbuf_2_1__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    12    0.13                           clknet_2_1__leaf_i_clk (net)
                  0.14    0.00    0.49 ^ clkbuf_leaf_7_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.04    0.16    0.65 ^ clkbuf_leaf_7_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     8    0.02                           clknet_leaf_7_i_clk (net)
                  0.04    0.00    0.65 ^ _3802_/CLK (sky130_fd_sc_hd__dfxtp_1)
                          0.10    0.75   clock uncertainty
                          0.00    0.75   clock reconvergence pessimism
                         -0.03    0.73   library hold time
                                  0.73   data required time
-----------------------------------------------------------------------------
                                  0.73   data required time
                                 -1.07   data arrival time
-----------------------------------------------------------------------------
                                  0.35   slack (MET)


min_report_end
max_report

===========================================================================
report_checks -path_delay max (Setup)
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3791_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.01    3.50 v _3217_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.82 v _3217_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0166_ (net)
                  0.05    0.00    3.82 v _3791_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.82   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3791_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.82   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3792_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.01    3.50 v _3219_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.82 v _3219_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0167_ (net)
                  0.05    0.00    3.82 v _3792_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.82   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3792_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.82   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3811_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.00    3.50 v _3259_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.81 v _3259_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0186_ (net)
                  0.05    0.00    3.81 v _3811_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.81   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3811_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.81   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3795_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.00    3.50 v _3225_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.81 v _3225_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0170_ (net)
                  0.05    0.00    3.81 v _3795_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.81   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_18_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_18_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_18_i_clk (net)
                  0.05    0.00    7.08 ^ _3795_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.81   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)


Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3796_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.00    3.50 v _3227_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.81 v _3227_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0171_ (net)
                  0.05    0.00    3.81 v _3796_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.81   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_18_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_18_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_18_i_clk (net)
                  0.05    0.00    7.08 ^ _3796_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.81   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)


max_report_end
check_report

===========================================================================
report_checks -unconstrained
============================================================================
Startpoint: i_wb_we (input port clocked by i_clk)
Endpoint: _3791_ (rising edge-triggered flip-flop clocked by i_clk)
Path Group: i_clk
Path Type: max

Fanout     Cap    Slew   Delay    Time   Description
-----------------------------------------------------------------------------
                          0.00    0.00   clock i_clk (rise edge)
                          0.00    0.00   clock network delay (propagated)
                          1.29    1.29 ^ input external delay
                  0.02    0.01    1.30 ^ i_wb_we (in)
     1    0.00                           i_wb_we (net)
                  0.02    0.00    1.30 ^ input60/A (sky130_fd_sc_hd__dlymetal6s2s_1)
                  0.17    0.17    1.47 ^ input60/X (sky130_fd_sc_hd__dlymetal6s2s_1)
     1    0.01                           net60 (net)
                  0.17    0.00    1.47 ^ _1875_/A (sky130_fd_sc_hd__buf_4)
                  0.18    0.25    1.72 ^ _1875_/X (sky130_fd_sc_hd__buf_4)
    14    0.06                           _1505_ (net)
                  0.18    0.00    1.72 ^ _1889_/A (sky130_fd_sc_hd__inv_2)
                  0.06    0.08    1.81 v _1889_/Y (sky130_fd_sc_hd__inv_2)
     6    0.02                           _1519_ (net)
                  0.06    0.00    1.81 v _1890_/B (sky130_fd_sc_hd__nand2_1)
                  0.16    0.15    1.96 ^ _1890_/Y (sky130_fd_sc_hd__nand2_1)
     4    0.02                           _1520_ (net)
                  0.16    0.00    1.96 ^ _2438_/A (sky130_fd_sc_hd__nor2_1)
                  0.08    0.11    2.07 v _2438_/Y (sky130_fd_sc_hd__nor2_1)
     4    0.01                           _0501_ (net)
                  0.08    0.00    2.07 v _3200_/A1 (sky130_fd_sc_hd__a211o_1)
                  0.04    0.25    2.32 v _3200_/X (sky130_fd_sc_hd__a211o_1)
     1    0.00                           _1141_ (net)
                  0.04    0.00    2.32 v _3202_/C (sky130_fd_sc_hd__or4_1)
                  0.12    0.51    2.84 v _3202_/X (sky130_fd_sc_hd__or4_1)
     1    0.01                           _1143_ (net)
                  0.12    0.00    2.84 v _3203_/C (sky130_fd_sc_hd__nor3_1)
                  0.32    0.28    3.11 ^ _3203_/Y (sky130_fd_sc_hd__nor3_1)
     1    0.01                           _1144_ (net)
                  0.32    0.00    3.11 ^ _3207_/A (sky130_fd_sc_hd__nand2_4)
                  0.14    0.17    3.28 v _3207_/Y (sky130_fd_sc_hd__nand2_4)
     7    0.04                           _1148_ (net)
                  0.15    0.00    3.28 v _3208_/A (sky130_fd_sc_hd__buf_8)
                  0.08    0.22    3.50 v _3208_/X (sky130_fd_sc_hd__buf_8)
    27    0.11                           _1149_ (net)
                  0.08    0.01    3.50 v _3217_/S (sky130_fd_sc_hd__mux2_1)
                  0.05    0.31    3.82 v _3217_/X (sky130_fd_sc_hd__mux2_1)
     1    0.00                           _0166_ (net)
                  0.05    0.00    3.82 v _3791_/D (sky130_fd_sc_hd__dfxtp_1)
                                  3.82   data arrival time

                          6.45    6.45   clock i_clk (rise edge)
                          0.00    6.45   clock source latency
                  0.12    0.08    6.53 ^ i_clk (in)
     1    0.03                           i_clk (net)
                  0.12    0.00    6.53 ^ clkbuf_0_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.08    0.19    6.72 ^ clkbuf_0_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     4    0.06                           clknet_0_i_clk (net)
                  0.08    0.00    6.72 ^ clkbuf_2_3__f_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.12    0.20    6.92 ^ clkbuf_2_3__f_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
     9    0.10                           clknet_2_3__leaf_i_clk (net)
                  0.12    0.00    6.92 ^ clkbuf_leaf_16_i_clk/A (sky130_fd_sc_hd__clkbuf_16)
                  0.05    0.16    7.08 ^ clkbuf_leaf_16_i_clk/X (sky130_fd_sc_hd__clkbuf_16)
    10    0.03                           clknet_leaf_16_i_clk (net)
                  0.05    0.00    7.08 ^ _3791_/CLK (sky130_fd_sc_hd__dfxtp_1)
                         -0.10    6.98   clock uncertainty
                          0.00    6.98   clock reconvergence pessimism
                         -0.11    6.87   library setup time
                                  6.87   data required time
-----------------------------------------------------------------------------
                                  6.87   data required time
                                 -3.82   data arrival time
-----------------------------------------------------------------------------
                                  3.05   slack (MET)



===========================================================================
report_checks --slack_max -0.01
============================================================================
No paths found.
check_report_end
check_slew

===========================================================================
 report_check_types -max_slew -max_cap -max_fanout -violators
============================================================================

===========================================================================
max slew violation count 0
max fanout violation count 0
max cap violation count 0
============================================================================
check_slew_end
tns_report

===========================================================================
 report_tns
============================================================================
tns 0.00
tns_report_end
wns_report

===========================================================================
 report_wns
============================================================================
wns 0.00
wns_report_end
worst_slack

===========================================================================
 report_worst_slack -max (Setup)
============================================================================
worst slack 3.05

===========================================================================
 report_worst_slack -min (Hold)
============================================================================
worst slack 0.34
worst_slack_end
clock_skew

===========================================================================
 report_clock_skew
============================================================================
Clock i_clk
Latency      CRPR       Skew
_3699_/CLK ^
   0.66
_3628_/CLK ^
   0.47      0.00       0.19

clock_skew_end
power_report

===========================================================================
 report_power
============================================================================
Group                  Internal  Switching    Leakage      Total
                          Power      Power      Power      Power (Watts)
----------------------------------------------------------------
Sequential             1.86e-03   1.06e-04   2.37e-09   1.97e-03  40.7%
Combinational          1.67e-03   1.19e-03   7.05e-09   2.86e-03  59.3%
Macro                  0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
Pad                    0.00e+00   0.00e+00   0.00e+00   0.00e+00   0.0%
----------------------------------------------------------------
Total                  3.53e-03   1.30e-03   9.42e-09   4.83e-03 100.0%
                          73.1%      26.9%       0.0%
power_report_end
area_report

===========================================================================
 report_design_area
============================================================================
Design area 21411 u^2 42% utilization.
area_report_end
